/* automatically generated by rust-bindgen 0.59.2 */

pub const GSL_COMPLEX_LEGACY: u32 = 1;
pub const GSL_RANGE_CHECK: u32 = 1;
pub const GSL_ROOT4_MACH_EPS: f64 = 0.000178;
pub const GSL_ROOT5_MACH_EPS: f64 = 0.001;
pub const GSL_ROOT6_MACH_EPS: f64 = 0.00316;
pub const GSL_LOG_MACH_EPS: f64 = -34.54;
pub const GSL_POSZERO: f64 = 0.0;
pub const GSL_NEGZERO: f64 = -0.0;
pub const GSL_BST_AVL_MAX_HEIGHT: u32 = 32;
pub const GSL_BST_RB_MAX_HEIGHT: u32 = 48;
pub const GSL_PREC_DOUBLE: u32 = 0;
pub const GSL_PREC_SINGLE: u32 = 1;
pub const GSL_PREC_APPROX: u32 = 2;
pub const GSL_MODE_DEFAULT: u32 = 0;
pub const GSL_CONST_CGS_MINUTE: f64 = 60.0;
pub const GSL_CONST_CGS_MICRON: f64 = 0.0001;
pub const GSL_CONST_CGS_ANGSTROM: f64 = 0.00000001;
pub const GSL_CONST_CGS_HECTARE: f64 = 100000000.0;
pub const GSL_CONST_CGS_BARN: f64 = 0.000000000000000000000001;
pub const GSL_CONST_CGS_LITER: f64 = 1000.0;
pub const GSL_CONST_CGS_METRIC_TON: f64 = 1000000.0;
pub const GSL_CONST_CGS_CARAT: f64 = 0.2;
pub const GSL_CONST_CGS_BAR: f64 = 1000000.0;
pub const GSL_CONST_CGS_POISE: f64 = 1.0;
pub const GSL_CONST_CGS_STOKES: f64 = 1.0;
pub const GSL_CONST_CGS_STILB: f64 = 1.0;
pub const GSL_CONST_CGS_LUMEN: f64 = 1.0;
pub const GSL_CONST_CGS_LUX: f64 = 0.0001;
pub const GSL_CONST_CGS_PHOT: f64 = 1.0;
pub const GSL_CONST_CGS_LAMBERT: f64 = 1.0;
pub const GSL_CONST_CGS_RAD: f64 = 100.0;
pub const GSL_CONST_CGS_NEWTON: f64 = 100000.0;
pub const GSL_CONST_CGS_DYNE: f64 = 1.0;

pub const GSL_CONST_MKS_ANGSTROM: f64 = 0.0000000001;
pub const GSL_CONST_MKS_HECTARE: f64 = 10000.0;
pub const GSL_CONST_MKS_BARN: f64 = 0.0000000000000000000000000001;
pub const GSL_CONST_MKS_LITER: f64 = 0.001;
pub const GSL_CONST_MKS_METRIC_TON: f64 = 1000.0;
pub const GSL_CONST_MKS_CARAT: f64 = 0.0002;
pub const GSL_CONST_MKS_BAR: f64 = 100000.0;
pub const GSL_CONST_MKS_POISE: f64 = 0.1;
pub const GSL_CONST_MKS_STOKES: f64 = 0.0001;
pub const GSL_CONST_MKS_STILB: f64 = 10000.0;
pub const GSL_CONST_MKS_LUMEN: f64 = 1.0;
pub const GSL_CONST_MKS_LUX: f64 = 1.0;
pub const GSL_CONST_MKS_PHOT: f64 = 10000.0;
pub const GSL_CONST_MKS_LAMBERT: f64 = 10000.0;
pub const GSL_CONST_MKS_RAD: f64 = 0.01;
pub const GSL_CONST_MKS_NEWTON: f64 = 1.0;
pub const GSL_CONST_MKS_DYNE: f64 = 0.00001;
pub const GSL_CONST_MKS_JOULE: f64 = 1.0;
pub const GSL_CONST_MKS_ERG: f64 = 0.0000001;
pub const GSL_CONST_MKS_GAUSS: f64 = 0.0001;
pub const GSL_CONST_MKSA_MINUTE: f64 = 60.0;
pub const GSL_CONST_MKSA_MICRON: f64 = 0.000001;
pub const GSL_CONST_MKSA_ANGSTROM: f64 = 0.0000000001;
pub const GSL_CONST_MKSA_HECTARE: f64 = 10000.0;
pub const GSL_CONST_MKSA_BARN: f64 = 0.0000000000000000000000000001;
pub const GSL_CONST_MKSA_LITER: f64 = 0.001;
pub const GSL_CONST_MKSA_METRIC_TON: f64 = 1000.0;
pub const GSL_CONST_MKSA_CARAT: f64 = 0.0002;
pub const GSL_CONST_MKSA_BAR: f64 = 100000.0;
pub const GSL_CONST_MKSA_POISE: f64 = 0.1;
pub const GSL_CONST_MKSA_STOKES: f64 = 0.0001;
pub const GSL_CONST_MKSA_STILB: f64 = 10000.0;
pub const GSL_CONST_MKSA_LUMEN: f64 = 1.0;
pub const GSL_CONST_MKSA_LUX: f64 = 1.0;
pub const GSL_CONST_MKSA_PHOT: f64 = 10000.0;
pub const GSL_CONST_MKSA_LAMBERT: f64 = 10000.0;
pub const GSL_CONST_MKSA_RAD: f64 = 0.01;
pub const GSL_CONST_MKSA_NEWTON: f64 = 1.0;
pub const GSL_CONST_MKSA_DYNE: f64 = 0.00001;
pub const GSL_CONST_MKSA_JOULE: f64 = 1.0;
pub const GSL_CONST_MKSA_ERG: f64 = 0.0000001;
pub const GSL_CONST_MKSA_GAUSS: f64 = 0.0001;
pub const GSL_MESSAGE_MASK: u32 = 4294967295;
pub const GSL_ODEIV_HADJ_INC: u32 = 1;
pub const GSL_ODEIV_HADJ_NIL: u32 = 0;
pub const GSL_ODEIV_HADJ_DEC: i32 = -1;
pub const GSL_SF_GAMMA_XMAX: f64 = 171.0;
pub const GSL_SF_FACT_NMAX: u32 = 170;
pub const GSL_SF_DOUBLEFACT_NMAX: u32 = 297;
pub const GSL_SF_MATHIEU_COEFF: u32 = 100;
pub const GSL_SPMATRIX_FLG_GROW: u32 = 1;
pub const GSL_SPMATRIX_FLG_FIXED: u32 = 2;
pub const GSL_VERSION: &[u8; 4usize] = b"2.7\0";
pub const GSL_MAJOR_VERSION: u32 = 2;
pub const GSL_MINOR_VERSION: u32 = 7;
pub type size_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type FILE = _IO_FILE;
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub const GSL_SUCCESS: ::std::os::raw::c_int = 0;
pub const GSL_FAILURE: ::std::os::raw::c_int = -1;
pub const GSL_CONTINUE: ::std::os::raw::c_int = -2;
pub const GSL_EDOM: ::std::os::raw::c_int = 1;
pub const GSL_ERANGE: ::std::os::raw::c_int = 2;
pub const GSL_EFAULT: ::std::os::raw::c_int = 3;
pub const GSL_EINVAL: ::std::os::raw::c_int = 4;
pub const GSL_EFAILED: ::std::os::raw::c_int = 5;
pub const GSL_EFACTOR: ::std::os::raw::c_int = 6;
pub const GSL_ESANITY: ::std::os::raw::c_int = 7;
pub const GSL_ENOMEM: ::std::os::raw::c_int = 8;
pub const GSL_EBADFUNC: ::std::os::raw::c_int = 9;
pub const GSL_ERUNAWAY: ::std::os::raw::c_int = 10;
pub const GSL_EMAXITER: ::std::os::raw::c_int = 11;
pub const GSL_EZERODIV: ::std::os::raw::c_int = 12;
pub const GSL_EBADTOL: ::std::os::raw::c_int = 13;
pub const GSL_ETOL: ::std::os::raw::c_int = 14;
pub const GSL_EUNDRFLW: ::std::os::raw::c_int = 15;
pub const GSL_EOVRFLW: ::std::os::raw::c_int = 16;
pub const GSL_ELOSS: ::std::os::raw::c_int = 17;
pub const GSL_EROUND: ::std::os::raw::c_int = 18;
pub const GSL_EBADLEN: ::std::os::raw::c_int = 19;
pub const GSL_ENOTSQR: ::std::os::raw::c_int = 20;
pub const GSL_ESING: ::std::os::raw::c_int = 21;
pub const GSL_EDIVERGE: ::std::os::raw::c_int = 22;
pub const GSL_EUNSUP: ::std::os::raw::c_int = 23;
pub const GSL_EUNIMPL: ::std::os::raw::c_int = 24;
pub const GSL_ECACHE: ::std::os::raw::c_int = 25;
pub const GSL_ETABLE: ::std::os::raw::c_int = 26;
pub const GSL_ENOPROG: ::std::os::raw::c_int = 27;
pub const GSL_ENOPROGJ: ::std::os::raw::c_int = 28;
pub const GSL_ETOLF: ::std::os::raw::c_int = 29;
pub const GSL_ETOLX: ::std::os::raw::c_int = 30;
pub const GSL_ETOLG: ::std::os::raw::c_int = 31;
pub const GSL_EOF: ::std::os::raw::c_int = 32;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
extern "C" {
    pub fn gsl_error(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        gsl_errno: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn gsl_stream_printf(
        label: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        reason: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn gsl_strerror(gsl_errno: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
pub type gsl_error_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        gsl_errno: ::std::os::raw::c_int,
    ),
>;
pub type gsl_stream_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        label: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        reason: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    pub fn gsl_set_error_handler(new_handler: gsl_error_handler_t) -> gsl_error_handler_t;
}
extern "C" {
    pub fn gsl_set_error_handler_off() -> gsl_error_handler_t;
}
extern "C" {
    pub fn gsl_set_stream_handler(new_handler: gsl_stream_handler_t) -> gsl_stream_handler_t;
}
extern "C" {
    pub fn gsl_set_stream(new_stream: *mut FILE) -> *mut FILE;
}
pub type gsl_complex_packed = *mut f64;
pub type gsl_complex_packed_float = *mut f32;
pub type gsl_const_complex_packed = *const f64;
pub type gsl_const_complex_packed_float = *const f32;
pub type gsl_complex_packed_array = *mut f64;
pub type gsl_complex_packed_array_float = *mut f32;
pub type gsl_const_complex_packed_array = *const f64;
pub type gsl_const_complex_packed_array_float = *const f32;
pub type gsl_complex_packed_ptr = *mut f64;
pub type gsl_complex_packed_float_ptr = *mut f32;
pub type gsl_const_complex_packed_ptr = *const f64;
pub type gsl_const_complex_packed_float_ptr = *const f32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_complex {
    pub dat: [f64; 2usize],
}
#[test]
fn bindgen_test_layout_gsl_complex() {
    assert_eq!(
        ::std::mem::size_of::<gsl_complex>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_complex))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_complex>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_complex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_complex>())).dat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_complex),
            "::",
            stringify!(dat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_complex_float {
    pub dat: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_gsl_complex_float() {
    assert_eq!(
        ::std::mem::size_of::<gsl_complex_float>(),
        8usize,
        concat!("Size of: ", stringify!(gsl_complex_float))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_complex_float>(),
        4usize,
        concat!("Alignment of ", stringify!(gsl_complex_float))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_complex_float>())).dat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_complex_float),
            "::",
            stringify!(dat)
        )
    );
}
extern "C" {
    pub static mut gsl_check_range: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_struct {
    pub size: size_t,
    pub data: *mut f64,
}
#[test]
fn bindgen_test_layout_gsl_block_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block = gsl_block_struct;
extern "C" {
    pub fn gsl_block_alloc(n: size_t) -> *mut gsl_block;
}
extern "C" {
    pub fn gsl_block_calloc(n: size_t) -> *mut gsl_block;
}
extern "C" {
    pub fn gsl_block_free(b: *mut gsl_block);
}
extern "C" {
    pub fn gsl_block_fread(stream: *mut FILE, b: *mut gsl_block) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_fwrite(stream: *mut FILE, b: *const gsl_block) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_fscanf(stream: *mut FILE, b: *mut gsl_block) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_fprintf(
        stream: *mut FILE,
        b: *const gsl_block,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_raw_fread(
        stream: *mut FILE,
        b: *mut f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_raw_fwrite(
        stream: *mut FILE,
        b: *const f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_raw_fscanf(
        stream: *mut FILE,
        b: *mut f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_raw_fprintf(
        stream: *mut FILE,
        b: *const f64,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_size(b: *const gsl_block) -> size_t;
}
extern "C" {
    pub fn gsl_block_data(b: *const gsl_block) -> *mut f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut f64,
    pub block: *mut gsl_block,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_view {
    pub vector: gsl_vector,
}
#[test]
fn bindgen_test_layout__gsl_vector_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_view = _gsl_vector_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_const_view {
    pub vector: gsl_vector,
}
#[test]
fn bindgen_test_layout__gsl_vector_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_const_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_const_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_const_view = _gsl_vector_const_view;
extern "C" {
    pub fn gsl_vector_alloc(n: size_t) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_vector_calloc(n: size_t) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_vector_alloc_from_block(
        b: *mut gsl_block,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_vector_alloc_from_vector(
        v: *mut gsl_vector,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_vector_free(v: *mut gsl_vector);
}
extern "C" {
    pub fn gsl_vector_view_array(v: *mut f64, n: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_view_array_with_stride(
        base: *mut f64,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_const_view_array(v: *const f64, n: size_t) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_const_view_array_with_stride(
        base: *const f64,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_subvector(v: *mut gsl_vector, i: size_t, n: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_subvector_with_stride(
        v: *mut gsl_vector,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_const_subvector(
        v: *const gsl_vector,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_const_subvector_with_stride(
        v: *const gsl_vector,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_set_zero(v: *mut gsl_vector);
}
extern "C" {
    pub fn gsl_vector_set_all(v: *mut gsl_vector, x: f64);
}
extern "C" {
    pub fn gsl_vector_set_basis(v: *mut gsl_vector, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_fread(stream: *mut FILE, v: *mut gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_fwrite(stream: *mut FILE, v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_fscanf(stream: *mut FILE, v: *mut gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_memcpy(
        dest: *mut gsl_vector,
        src: *const gsl_vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_reverse(v: *mut gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_swap(v: *mut gsl_vector, w: *mut gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_swap_elements(
        v: *mut gsl_vector,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_max(v: *const gsl_vector) -> f64;
}
extern "C" {
    pub fn gsl_vector_min(v: *const gsl_vector) -> f64;
}
extern "C" {
    pub fn gsl_vector_minmax(v: *const gsl_vector, min_out: *mut f64, max_out: *mut f64);
}
extern "C" {
    pub fn gsl_vector_max_index(v: *const gsl_vector) -> size_t;
}
extern "C" {
    pub fn gsl_vector_min_index(v: *const gsl_vector) -> size_t;
}
extern "C" {
    pub fn gsl_vector_minmax_index(v: *const gsl_vector, imin: *mut size_t, imax: *mut size_t);
}
extern "C" {
    pub fn gsl_vector_add(a: *mut gsl_vector, b: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_sub(a: *mut gsl_vector, b: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_mul(a: *mut gsl_vector, b: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_div(a: *mut gsl_vector, b: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_scale(a: *mut gsl_vector, x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_add_constant(a: *mut gsl_vector, x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_axpby(
        alpha: f64,
        x: *const gsl_vector,
        beta: f64,
        y: *mut gsl_vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_sum(a: *const gsl_vector) -> f64;
}
extern "C" {
    pub fn gsl_vector_equal(u: *const gsl_vector, v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_isnull(v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ispos(v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_isneg(v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_isnonneg(v: *const gsl_vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_get(v: *const gsl_vector, i: size_t) -> f64;
}
extern "C" {
    pub fn gsl_vector_set(v: *mut gsl_vector, i: size_t, x: f64);
}
extern "C" {
    pub fn gsl_vector_ptr(v: *mut gsl_vector, i: size_t) -> *mut f64;
}
extern "C" {
    pub fn gsl_vector_const_ptr(v: *const gsl_vector, i: size_t) -> *const f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_complex_struct {
    pub size: size_t,
    pub data: *mut f64,
}
#[test]
fn bindgen_test_layout_gsl_block_complex_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_complex_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_complex_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_complex_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_complex_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_complex_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_complex_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_complex_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_complex_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_complex = gsl_block_complex_struct;
extern "C" {
    pub fn gsl_block_complex_alloc(n: size_t) -> *mut gsl_block_complex;
}
extern "C" {
    pub fn gsl_block_complex_calloc(n: size_t) -> *mut gsl_block_complex;
}
extern "C" {
    pub fn gsl_block_complex_free(b: *mut gsl_block_complex);
}
extern "C" {
    pub fn gsl_block_complex_fread(
        stream: *mut FILE,
        b: *mut gsl_block_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_complex,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_raw_fread(
        stream: *mut FILE,
        b: *mut f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_raw_fwrite(
        stream: *mut FILE,
        b: *const f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_raw_fscanf(
        stream: *mut FILE,
        b: *mut f64,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_raw_fprintf(
        stream: *mut FILE,
        b: *const f64,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_size(b: *const gsl_block_complex) -> size_t;
}
extern "C" {
    pub fn gsl_block_complex_data(b: *const gsl_block_complex) -> *mut f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_complex {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut f64,
    pub block: *mut gsl_block_complex,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_complex() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_complex>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_complex))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_complex>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_complex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_complex_view {
    pub vector: gsl_vector_complex,
}
#[test]
fn bindgen_test_layout__gsl_vector_complex_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_complex_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_complex_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_complex_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_complex_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_complex_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_complex_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_complex_view = _gsl_vector_complex_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_complex_const_view {
    pub vector: gsl_vector_complex,
}
#[test]
fn bindgen_test_layout__gsl_vector_complex_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_complex_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_complex_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_complex_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_complex_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_complex_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_complex_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_complex_const_view = _gsl_vector_complex_const_view;
extern "C" {
    pub fn gsl_vector_complex_alloc(n: size_t) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_vector_complex_calloc(n: size_t) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_vector_complex_alloc_from_block(
        b: *mut gsl_block_complex,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_vector_complex_alloc_from_vector(
        v: *mut gsl_vector_complex,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_vector_complex_free(v: *mut gsl_vector_complex);
}
extern "C" {
    pub fn gsl_vector_complex_view_array(base: *mut f64, n: size_t) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_vector_complex_view_array_with_stride(
        base: *mut f64,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_view_array(
        base: *const f64,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_view_array_with_stride(
        base: *const f64,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_subvector(
        base: *mut gsl_vector_complex,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_vector_complex_subvector_with_stride(
        v: *mut gsl_vector_complex,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_subvector(
        base: *const gsl_vector_complex,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_subvector_with_stride(
        v: *const gsl_vector_complex,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_real(v: *mut gsl_vector_complex) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_complex_imag(v: *mut gsl_vector_complex) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_real(v: *const gsl_vector_complex) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_const_imag(v: *const gsl_vector_complex) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_set_zero(v: *mut gsl_vector_complex);
}
extern "C" {
    pub fn gsl_vector_complex_set_all(v: *mut gsl_vector_complex, z: gsl_complex);
}
extern "C" {
    pub fn gsl_vector_complex_set_basis(
        v: *mut gsl_vector_complex,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_complex,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_memcpy(
        dest: *mut gsl_vector_complex,
        src: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_reverse(v: *mut gsl_vector_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_swap(
        v: *mut gsl_vector_complex,
        w: *mut gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_swap_elements(
        v: *mut gsl_vector_complex,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_equal(
        u: *const gsl_vector_complex,
        v: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_isnull(v: *const gsl_vector_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_ispos(v: *const gsl_vector_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_isneg(v: *const gsl_vector_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_isnonneg(v: *const gsl_vector_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_add(
        a: *mut gsl_vector_complex,
        b: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_sub(
        a: *mut gsl_vector_complex,
        b: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_mul(
        a: *mut gsl_vector_complex,
        b: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_div(
        a: *mut gsl_vector_complex,
        b: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_scale(
        a: *mut gsl_vector_complex,
        x: gsl_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_add_constant(
        a: *mut gsl_vector_complex,
        x: gsl_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_axpby(
        alpha: gsl_complex,
        x: *const gsl_vector_complex,
        beta: gsl_complex,
        y: *mut gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_get(v: *const gsl_vector_complex, i: size_t) -> gsl_complex;
}
extern "C" {
    pub fn gsl_vector_complex_set(v: *mut gsl_vector_complex, i: size_t, z: gsl_complex);
}
extern "C" {
    pub fn gsl_vector_complex_ptr(v: *mut gsl_vector_complex, i: size_t) -> *mut gsl_complex;
}
extern "C" {
    pub fn gsl_vector_complex_const_ptr(
        v: *const gsl_vector_complex,
        i: size_t,
    ) -> *const gsl_complex;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_float_struct {
    pub size: size_t,
    pub data: *mut f32,
}
#[test]
fn bindgen_test_layout_gsl_block_float_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_float_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_float_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_float_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_float_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_float_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_float_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_float_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_float_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_float = gsl_block_float_struct;
extern "C" {
    pub fn gsl_block_float_alloc(n: size_t) -> *mut gsl_block_float;
}
extern "C" {
    pub fn gsl_block_float_calloc(n: size_t) -> *mut gsl_block_float;
}
extern "C" {
    pub fn gsl_block_float_free(b: *mut gsl_block_float);
}
extern "C" {
    pub fn gsl_block_float_fread(
        stream: *mut FILE,
        b: *mut gsl_block_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_raw_fread(
        stream: *mut FILE,
        b: *mut f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_raw_fwrite(
        stream: *mut FILE,
        b: *const f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_raw_fscanf(
        stream: *mut FILE,
        b: *mut f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_raw_fprintf(
        stream: *mut FILE,
        b: *const f32,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_float_size(b: *const gsl_block_float) -> size_t;
}
extern "C" {
    pub fn gsl_block_float_data(b: *const gsl_block_float) -> *mut f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_float {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut f32,
    pub block: *mut gsl_block_float,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_float() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_float>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_float))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_float>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_float))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_float>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_float),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_float>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_float),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_float>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_float),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_float>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_float),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_float>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_float),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_float_view {
    pub vector: gsl_vector_float,
}
#[test]
fn bindgen_test_layout__gsl_vector_float_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_float_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_float_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_float_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_float_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_float_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_float_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_float_view = _gsl_vector_float_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_float_const_view {
    pub vector: gsl_vector_float,
}
#[test]
fn bindgen_test_layout__gsl_vector_float_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_float_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_float_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_float_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_float_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_float_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_float_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_float_const_view = _gsl_vector_float_const_view;
extern "C" {
    pub fn gsl_vector_float_alloc(n: size_t) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_vector_float_calloc(n: size_t) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_vector_float_alloc_from_block(
        b: *mut gsl_block_float,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_vector_float_alloc_from_vector(
        v: *mut gsl_vector_float,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_vector_float_free(v: *mut gsl_vector_float);
}
extern "C" {
    pub fn gsl_vector_float_view_array(v: *mut f32, n: size_t) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_float_view_array_with_stride(
        base: *mut f32,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_float_const_view_array(
        v: *const f32,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_float_const_view_array_with_stride(
        base: *const f32,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_float_subvector(
        v: *mut gsl_vector_float,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_float_subvector_with_stride(
        v: *mut gsl_vector_float,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_float_const_subvector(
        v: *const gsl_vector_float,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_float_const_subvector_with_stride(
        v: *const gsl_vector_float,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_float_set_zero(v: *mut gsl_vector_float);
}
extern "C" {
    pub fn gsl_vector_float_set_all(v: *mut gsl_vector_float, x: f32);
}
extern "C" {
    pub fn gsl_vector_float_set_basis(v: *mut gsl_vector_float, i: size_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_memcpy(
        dest: *mut gsl_vector_float,
        src: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_reverse(v: *mut gsl_vector_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_swap(
        v: *mut gsl_vector_float,
        w: *mut gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_swap_elements(
        v: *mut gsl_vector_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_max(v: *const gsl_vector_float) -> f32;
}
extern "C" {
    pub fn gsl_vector_float_min(v: *const gsl_vector_float) -> f32;
}
extern "C" {
    pub fn gsl_vector_float_minmax(
        v: *const gsl_vector_float,
        min_out: *mut f32,
        max_out: *mut f32,
    );
}
extern "C" {
    pub fn gsl_vector_float_max_index(v: *const gsl_vector_float) -> size_t;
}
extern "C" {
    pub fn gsl_vector_float_min_index(v: *const gsl_vector_float) -> size_t;
}
extern "C" {
    pub fn gsl_vector_float_minmax_index(
        v: *const gsl_vector_float,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_float_add(
        a: *mut gsl_vector_float,
        b: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_sub(
        a: *mut gsl_vector_float,
        b: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_mul(
        a: *mut gsl_vector_float,
        b: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_div(
        a: *mut gsl_vector_float,
        b: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_scale(a: *mut gsl_vector_float, x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_add_constant(a: *mut gsl_vector_float, x: f32)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_axpby(
        alpha: f32,
        x: *const gsl_vector_float,
        beta: f32,
        y: *mut gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_sum(a: *const gsl_vector_float) -> f32;
}
extern "C" {
    pub fn gsl_vector_float_equal(
        u: *const gsl_vector_float,
        v: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_isnull(v: *const gsl_vector_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_ispos(v: *const gsl_vector_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_isneg(v: *const gsl_vector_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_isnonneg(v: *const gsl_vector_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_float_get(v: *const gsl_vector_float, i: size_t) -> f32;
}
extern "C" {
    pub fn gsl_vector_float_set(v: *mut gsl_vector_float, i: size_t, x: f32);
}
extern "C" {
    pub fn gsl_vector_float_ptr(v: *mut gsl_vector_float, i: size_t) -> *mut f32;
}
extern "C" {
    pub fn gsl_vector_float_const_ptr(v: *const gsl_vector_float, i: size_t) -> *const f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_complex_float_struct {
    pub size: size_t,
    pub data: *mut f32,
}
#[test]
fn bindgen_test_layout_gsl_block_complex_float_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_complex_float_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_complex_float_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_complex_float_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_complex_float_struct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gsl_block_complex_float_struct>())).size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_complex_float_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gsl_block_complex_float_struct>())).data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_complex_float_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_complex_float = gsl_block_complex_float_struct;
extern "C" {
    pub fn gsl_block_complex_float_alloc(n: size_t) -> *mut gsl_block_complex_float;
}
extern "C" {
    pub fn gsl_block_complex_float_calloc(n: size_t) -> *mut gsl_block_complex_float;
}
extern "C" {
    pub fn gsl_block_complex_float_free(b: *mut gsl_block_complex_float);
}
extern "C" {
    pub fn gsl_block_complex_float_fread(
        stream: *mut FILE,
        b: *mut gsl_block_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_complex_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_raw_fread(
        stream: *mut FILE,
        b: *mut f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_raw_fwrite(
        stream: *mut FILE,
        b: *const f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_raw_fscanf(
        stream: *mut FILE,
        b: *mut f32,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_raw_fprintf(
        stream: *mut FILE,
        b: *const f32,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_complex_float_size(b: *const gsl_block_complex_float) -> size_t;
}
extern "C" {
    pub fn gsl_block_complex_float_data(b: *const gsl_block_complex_float) -> *mut f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_complex_float {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut f32,
    pub block: *mut gsl_block_complex_float,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_complex_float() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_complex_float>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_complex_float))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_complex_float>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_complex_float))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex_float>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex_float),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex_float>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex_float),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex_float>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex_float),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex_float>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex_float),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_complex_float>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_complex_float),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_complex_float_view {
    pub vector: gsl_vector_complex_float,
}
#[test]
fn bindgen_test_layout__gsl_vector_complex_float_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_complex_float_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_complex_float_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_complex_float_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_complex_float_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_complex_float_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_complex_float_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_complex_float_view = _gsl_vector_complex_float_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_complex_float_const_view {
    pub vector: gsl_vector_complex_float,
}
#[test]
fn bindgen_test_layout__gsl_vector_complex_float_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_complex_float_const_view>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_gsl_vector_complex_float_const_view)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_complex_float_const_view>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_gsl_vector_complex_float_const_view)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_complex_float_const_view>())).vector as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_complex_float_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_complex_float_const_view = _gsl_vector_complex_float_const_view;
extern "C" {
    pub fn gsl_vector_complex_float_alloc(n: size_t) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_calloc(n: size_t) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_alloc_from_block(
        b: *mut gsl_block_complex_float,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_alloc_from_vector(
        v: *mut gsl_vector_complex_float,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_free(v: *mut gsl_vector_complex_float);
}
extern "C" {
    pub fn gsl_vector_complex_float_view_array(
        base: *mut f32,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_view_array_with_stride(
        base: *mut f32,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_view_array(
        base: *const f32,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_view_array_with_stride(
        base: *const f32,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_subvector(
        base: *mut gsl_vector_complex_float,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_subvector_with_stride(
        v: *mut gsl_vector_complex_float,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_subvector(
        base: *const gsl_vector_complex_float,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_subvector_with_stride(
        v: *const gsl_vector_complex_float,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_real(
        v: *mut gsl_vector_complex_float,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_imag(
        v: *mut gsl_vector_complex_float,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_real(
        v: *const gsl_vector_complex_float,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_imag(
        v: *const gsl_vector_complex_float,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_vector_complex_float_set_zero(v: *mut gsl_vector_complex_float);
}
extern "C" {
    pub fn gsl_vector_complex_float_set_all(v: *mut gsl_vector_complex_float, z: gsl_complex_float);
}
extern "C" {
    pub fn gsl_vector_complex_float_set_basis(
        v: *mut gsl_vector_complex_float,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_complex_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_memcpy(
        dest: *mut gsl_vector_complex_float,
        src: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_reverse(
        v: *mut gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_swap(
        v: *mut gsl_vector_complex_float,
        w: *mut gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_swap_elements(
        v: *mut gsl_vector_complex_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_equal(
        u: *const gsl_vector_complex_float,
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_isnull(
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_ispos(
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_isneg(
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_isnonneg(
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_add(
        a: *mut gsl_vector_complex_float,
        b: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_sub(
        a: *mut gsl_vector_complex_float,
        b: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_mul(
        a: *mut gsl_vector_complex_float,
        b: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_div(
        a: *mut gsl_vector_complex_float,
        b: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_scale(
        a: *mut gsl_vector_complex_float,
        x: gsl_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_add_constant(
        a: *mut gsl_vector_complex_float,
        x: gsl_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_axpby(
        alpha: gsl_complex_float,
        x: *const gsl_vector_complex_float,
        beta: gsl_complex_float,
        y: *mut gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_complex_float_get(
        v: *const gsl_vector_complex_float,
        i: size_t,
    ) -> gsl_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_set(
        v: *mut gsl_vector_complex_float,
        i: size_t,
        z: gsl_complex_float,
    );
}
extern "C" {
    pub fn gsl_vector_complex_float_ptr(
        v: *mut gsl_vector_complex_float,
        i: size_t,
    ) -> *mut gsl_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_const_ptr(
        v: *const gsl_vector_complex_float,
        i: size_t,
    ) -> *const gsl_complex_float;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_ulong_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_gsl_block_ulong_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_ulong_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_ulong_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_ulong_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_ulong_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_ulong_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_ulong_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_ulong_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_ulong_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_ulong = gsl_block_ulong_struct;
extern "C" {
    pub fn gsl_block_ulong_alloc(n: size_t) -> *mut gsl_block_ulong;
}
extern "C" {
    pub fn gsl_block_ulong_calloc(n: size_t) -> *mut gsl_block_ulong;
}
extern "C" {
    pub fn gsl_block_ulong_free(b: *mut gsl_block_ulong);
}
extern "C" {
    pub fn gsl_block_ulong_fread(
        stream: *mut FILE,
        b: *mut gsl_block_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_ulong,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_ulong,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_ulong,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_ulong,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_ulong,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ulong_size(b: *const gsl_block_ulong) -> size_t;
}
extern "C" {
    pub fn gsl_block_ulong_data(b: *const gsl_block_ulong) -> *mut ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_ulong {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_ulong,
    pub block: *mut gsl_block_ulong,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_ulong() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_ulong>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_ulong))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_ulong>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_ulong))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ulong>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ulong),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ulong>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ulong),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ulong>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ulong),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ulong>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ulong),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ulong>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ulong),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_ulong_view {
    pub vector: gsl_vector_ulong,
}
#[test]
fn bindgen_test_layout__gsl_vector_ulong_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_ulong_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_ulong_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_ulong_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_ulong_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_ulong_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_ulong_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_ulong_view = _gsl_vector_ulong_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_ulong_const_view {
    pub vector: gsl_vector_ulong,
}
#[test]
fn bindgen_test_layout__gsl_vector_ulong_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_ulong_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_ulong_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_ulong_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_ulong_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_ulong_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_ulong_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_ulong_const_view = _gsl_vector_ulong_const_view;
extern "C" {
    pub fn gsl_vector_ulong_alloc(n: size_t) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_calloc(n: size_t) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_alloc_from_block(
        b: *mut gsl_block_ulong,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_alloc_from_vector(
        v: *mut gsl_vector_ulong,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_free(v: *mut gsl_vector_ulong);
}
extern "C" {
    pub fn gsl_vector_ulong_view_array(
        v: *mut ::std::os::raw::c_ulong,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_vector_ulong_view_array_with_stride(
        base: *mut ::std::os::raw::c_ulong,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_vector_ulong_const_view_array(
        v: *const ::std::os::raw::c_ulong,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_vector_ulong_const_view_array_with_stride(
        base: *const ::std::os::raw::c_ulong,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_vector_ulong_subvector(
        v: *mut gsl_vector_ulong,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_vector_ulong_subvector_with_stride(
        v: *mut gsl_vector_ulong,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_vector_ulong_const_subvector(
        v: *const gsl_vector_ulong,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_vector_ulong_const_subvector_with_stride(
        v: *const gsl_vector_ulong,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_vector_ulong_set_zero(v: *mut gsl_vector_ulong);
}
extern "C" {
    pub fn gsl_vector_ulong_set_all(v: *mut gsl_vector_ulong, x: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn gsl_vector_ulong_set_basis(v: *mut gsl_vector_ulong, i: size_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_ulong,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_memcpy(
        dest: *mut gsl_vector_ulong,
        src: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_reverse(v: *mut gsl_vector_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_swap(
        v: *mut gsl_vector_ulong,
        w: *mut gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_swap_elements(
        v: *mut gsl_vector_ulong,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_max(v: *const gsl_vector_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_min(v: *const gsl_vector_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_minmax(
        v: *const gsl_vector_ulong,
        min_out: *mut ::std::os::raw::c_ulong,
        max_out: *mut ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn gsl_vector_ulong_max_index(v: *const gsl_vector_ulong) -> size_t;
}
extern "C" {
    pub fn gsl_vector_ulong_min_index(v: *const gsl_vector_ulong) -> size_t;
}
extern "C" {
    pub fn gsl_vector_ulong_minmax_index(
        v: *const gsl_vector_ulong,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_ulong_add(
        a: *mut gsl_vector_ulong,
        b: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_sub(
        a: *mut gsl_vector_ulong,
        b: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_mul(
        a: *mut gsl_vector_ulong,
        b: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_div(
        a: *mut gsl_vector_ulong,
        b: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_scale(
        a: *mut gsl_vector_ulong,
        x: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_add_constant(
        a: *mut gsl_vector_ulong,
        x: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_axpby(
        alpha: ::std::os::raw::c_ulong,
        x: *const gsl_vector_ulong,
        beta: ::std::os::raw::c_ulong,
        y: *mut gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_sum(a: *const gsl_vector_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_equal(
        u: *const gsl_vector_ulong,
        v: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_isnull(v: *const gsl_vector_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_ispos(v: *const gsl_vector_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_isneg(v: *const gsl_vector_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_isnonneg(v: *const gsl_vector_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ulong_get(v: *const gsl_vector_ulong, i: size_t) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_set(v: *mut gsl_vector_ulong, i: size_t, x: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn gsl_vector_ulong_ptr(
        v: *mut gsl_vector_ulong,
        i: size_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_const_ptr(
        v: *const gsl_vector_ulong,
        i: size_t,
    ) -> *const ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_long_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_gsl_block_long_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_long_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_long_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_long_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_long_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_long_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_long_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_long_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_long_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_long = gsl_block_long_struct;
extern "C" {
    pub fn gsl_block_long_alloc(n: size_t) -> *mut gsl_block_long;
}
extern "C" {
    pub fn gsl_block_long_calloc(n: size_t) -> *mut gsl_block_long;
}
extern "C" {
    pub fn gsl_block_long_free(b: *mut gsl_block_long);
}
extern "C" {
    pub fn gsl_block_long_fread(stream: *mut FILE, b: *mut gsl_block_long)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_long,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_long,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_long,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_long,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_long,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_long_size(b: *const gsl_block_long) -> size_t;
}
extern "C" {
    pub fn gsl_block_long_data(b: *const gsl_block_long) -> *mut ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_long {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_long,
    pub block: *mut gsl_block_long,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_long() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_long>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_long))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_long>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_long))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_long>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_long),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_long>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_long),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_long>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_long),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_long>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_long),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_long>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_long),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_long_view {
    pub vector: gsl_vector_long,
}
#[test]
fn bindgen_test_layout__gsl_vector_long_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_long_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_long_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_long_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_long_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_long_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_long_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_long_view = _gsl_vector_long_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_long_const_view {
    pub vector: gsl_vector_long,
}
#[test]
fn bindgen_test_layout__gsl_vector_long_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_long_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_long_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_long_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_long_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_long_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_long_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_long_const_view = _gsl_vector_long_const_view;
extern "C" {
    pub fn gsl_vector_long_alloc(n: size_t) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_vector_long_calloc(n: size_t) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_vector_long_alloc_from_block(
        b: *mut gsl_block_long,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_vector_long_alloc_from_vector(
        v: *mut gsl_vector_long,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_vector_long_free(v: *mut gsl_vector_long);
}
extern "C" {
    pub fn gsl_vector_long_view_array(
        v: *mut ::std::os::raw::c_long,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_vector_long_view_array_with_stride(
        base: *mut ::std::os::raw::c_long,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_vector_long_const_view_array(
        v: *const ::std::os::raw::c_long,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_vector_long_const_view_array_with_stride(
        base: *const ::std::os::raw::c_long,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_vector_long_subvector(
        v: *mut gsl_vector_long,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_vector_long_subvector_with_stride(
        v: *mut gsl_vector_long,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_vector_long_const_subvector(
        v: *const gsl_vector_long,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_vector_long_const_subvector_with_stride(
        v: *const gsl_vector_long,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_vector_long_set_zero(v: *mut gsl_vector_long);
}
extern "C" {
    pub fn gsl_vector_long_set_all(v: *mut gsl_vector_long, x: ::std::os::raw::c_long);
}
extern "C" {
    pub fn gsl_vector_long_set_basis(v: *mut gsl_vector_long, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_long,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_memcpy(
        dest: *mut gsl_vector_long,
        src: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_reverse(v: *mut gsl_vector_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_swap(
        v: *mut gsl_vector_long,
        w: *mut gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_swap_elements(
        v: *mut gsl_vector_long,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_max(v: *const gsl_vector_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_vector_long_min(v: *const gsl_vector_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_vector_long_minmax(
        v: *const gsl_vector_long,
        min_out: *mut ::std::os::raw::c_long,
        max_out: *mut ::std::os::raw::c_long,
    );
}
extern "C" {
    pub fn gsl_vector_long_max_index(v: *const gsl_vector_long) -> size_t;
}
extern "C" {
    pub fn gsl_vector_long_min_index(v: *const gsl_vector_long) -> size_t;
}
extern "C" {
    pub fn gsl_vector_long_minmax_index(
        v: *const gsl_vector_long,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_long_add(
        a: *mut gsl_vector_long,
        b: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_sub(
        a: *mut gsl_vector_long,
        b: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_mul(
        a: *mut gsl_vector_long,
        b: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_div(
        a: *mut gsl_vector_long,
        b: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_scale(
        a: *mut gsl_vector_long,
        x: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_add_constant(
        a: *mut gsl_vector_long,
        x: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_axpby(
        alpha: ::std::os::raw::c_long,
        x: *const gsl_vector_long,
        beta: ::std::os::raw::c_long,
        y: *mut gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_sum(a: *const gsl_vector_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_vector_long_equal(
        u: *const gsl_vector_long,
        v: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_isnull(v: *const gsl_vector_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_ispos(v: *const gsl_vector_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_isneg(v: *const gsl_vector_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_isnonneg(v: *const gsl_vector_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_long_get(v: *const gsl_vector_long, i: size_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_vector_long_set(v: *mut gsl_vector_long, i: size_t, x: ::std::os::raw::c_long);
}
extern "C" {
    pub fn gsl_vector_long_ptr(v: *mut gsl_vector_long, i: size_t) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_vector_long_const_ptr(
        v: *const gsl_vector_long,
        i: size_t,
    ) -> *const ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_uint_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_gsl_block_uint_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_uint_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_uint_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_uint_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_uint_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_uint_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_uint_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_uint_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_uint_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_uint = gsl_block_uint_struct;
extern "C" {
    pub fn gsl_block_uint_alloc(n: size_t) -> *mut gsl_block_uint;
}
extern "C" {
    pub fn gsl_block_uint_calloc(n: size_t) -> *mut gsl_block_uint;
}
extern "C" {
    pub fn gsl_block_uint_free(b: *mut gsl_block_uint);
}
extern "C" {
    pub fn gsl_block_uint_fread(stream: *mut FILE, b: *mut gsl_block_uint)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_uint,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_uint,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_uint,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_uint,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_uint,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uint_size(b: *const gsl_block_uint) -> size_t;
}
extern "C" {
    pub fn gsl_block_uint_data(b: *const gsl_block_uint) -> *mut ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_uint {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_uint,
    pub block: *mut gsl_block_uint,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_uint() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_uint>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uint>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uint),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uint>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uint),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uint>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uint),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uint>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uint),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uint>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uint),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_uint_view {
    pub vector: gsl_vector_uint,
}
#[test]
fn bindgen_test_layout__gsl_vector_uint_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_uint_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_uint_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_uint_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_uint_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_uint_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_uint_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_uint_view = _gsl_vector_uint_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_uint_const_view {
    pub vector: gsl_vector_uint,
}
#[test]
fn bindgen_test_layout__gsl_vector_uint_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_uint_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_uint_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_uint_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_uint_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_uint_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_uint_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_uint_const_view = _gsl_vector_uint_const_view;
extern "C" {
    pub fn gsl_vector_uint_alloc(n: size_t) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_vector_uint_calloc(n: size_t) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_vector_uint_alloc_from_block(
        b: *mut gsl_block_uint,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_vector_uint_alloc_from_vector(
        v: *mut gsl_vector_uint,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_vector_uint_free(v: *mut gsl_vector_uint);
}
extern "C" {
    pub fn gsl_vector_uint_view_array(
        v: *mut ::std::os::raw::c_uint,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_vector_uint_view_array_with_stride(
        base: *mut ::std::os::raw::c_uint,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_vector_uint_const_view_array(
        v: *const ::std::os::raw::c_uint,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_vector_uint_const_view_array_with_stride(
        base: *const ::std::os::raw::c_uint,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_vector_uint_subvector(
        v: *mut gsl_vector_uint,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_vector_uint_subvector_with_stride(
        v: *mut gsl_vector_uint,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_vector_uint_const_subvector(
        v: *const gsl_vector_uint,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_vector_uint_const_subvector_with_stride(
        v: *const gsl_vector_uint,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_vector_uint_set_zero(v: *mut gsl_vector_uint);
}
extern "C" {
    pub fn gsl_vector_uint_set_all(v: *mut gsl_vector_uint, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn gsl_vector_uint_set_basis(v: *mut gsl_vector_uint, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_uint,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_memcpy(
        dest: *mut gsl_vector_uint,
        src: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_reverse(v: *mut gsl_vector_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_swap(
        v: *mut gsl_vector_uint,
        w: *mut gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_swap_elements(
        v: *mut gsl_vector_uint,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_max(v: *const gsl_vector_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_vector_uint_min(v: *const gsl_vector_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_vector_uint_minmax(
        v: *const gsl_vector_uint,
        min_out: *mut ::std::os::raw::c_uint,
        max_out: *mut ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn gsl_vector_uint_max_index(v: *const gsl_vector_uint) -> size_t;
}
extern "C" {
    pub fn gsl_vector_uint_min_index(v: *const gsl_vector_uint) -> size_t;
}
extern "C" {
    pub fn gsl_vector_uint_minmax_index(
        v: *const gsl_vector_uint,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_uint_add(
        a: *mut gsl_vector_uint,
        b: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_sub(
        a: *mut gsl_vector_uint,
        b: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_mul(
        a: *mut gsl_vector_uint,
        b: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_div(
        a: *mut gsl_vector_uint,
        b: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_scale(
        a: *mut gsl_vector_uint,
        x: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_add_constant(
        a: *mut gsl_vector_uint,
        x: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_axpby(
        alpha: ::std::os::raw::c_uint,
        x: *const gsl_vector_uint,
        beta: ::std::os::raw::c_uint,
        y: *mut gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_sum(a: *const gsl_vector_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_vector_uint_equal(
        u: *const gsl_vector_uint,
        v: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_isnull(v: *const gsl_vector_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_ispos(v: *const gsl_vector_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_isneg(v: *const gsl_vector_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_isnonneg(v: *const gsl_vector_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uint_get(v: *const gsl_vector_uint, i: size_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_vector_uint_set(v: *mut gsl_vector_uint, i: size_t, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn gsl_vector_uint_ptr(v: *mut gsl_vector_uint, i: size_t) -> *mut ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_vector_uint_const_ptr(
        v: *const gsl_vector_uint,
        i: size_t,
    ) -> *const ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_int_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_block_int_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_int_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_int_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_int_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_int_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_int_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_int_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_int_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_int_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_int = gsl_block_int_struct;
extern "C" {
    pub fn gsl_block_int_alloc(n: size_t) -> *mut gsl_block_int;
}
extern "C" {
    pub fn gsl_block_int_calloc(n: size_t) -> *mut gsl_block_int;
}
extern "C" {
    pub fn gsl_block_int_free(b: *mut gsl_block_int);
}
extern "C" {
    pub fn gsl_block_int_fread(stream: *mut FILE, b: *mut gsl_block_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_fscanf(stream: *mut FILE, b: *mut gsl_block_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_int,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_int,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_int,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_int,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_int,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_int_size(b: *const gsl_block_int) -> size_t;
}
extern "C" {
    pub fn gsl_block_int_data(b: *const gsl_block_int) -> *mut ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_int {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_int,
    pub block: *mut gsl_block_int,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_int() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_int>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_int))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_int>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_int>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_int),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_int>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_int),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_int>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_int),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_int>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_int),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_int>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_int),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_int_view {
    pub vector: gsl_vector_int,
}
#[test]
fn bindgen_test_layout__gsl_vector_int_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_int_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_int_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_int_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_int_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_int_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_int_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_int_view = _gsl_vector_int_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_int_const_view {
    pub vector: gsl_vector_int,
}
#[test]
fn bindgen_test_layout__gsl_vector_int_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_int_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_int_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_int_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_int_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_int_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_int_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_int_const_view = _gsl_vector_int_const_view;
extern "C" {
    pub fn gsl_vector_int_alloc(n: size_t) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_vector_int_calloc(n: size_t) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_vector_int_alloc_from_block(
        b: *mut gsl_block_int,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_vector_int_alloc_from_vector(
        v: *mut gsl_vector_int,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_vector_int_free(v: *mut gsl_vector_int);
}
extern "C" {
    pub fn gsl_vector_int_view_array(
        v: *mut ::std::os::raw::c_int,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_vector_int_view_array_with_stride(
        base: *mut ::std::os::raw::c_int,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_vector_int_const_view_array(
        v: *const ::std::os::raw::c_int,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_vector_int_const_view_array_with_stride(
        base: *const ::std::os::raw::c_int,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_vector_int_subvector(
        v: *mut gsl_vector_int,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_vector_int_subvector_with_stride(
        v: *mut gsl_vector_int,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_vector_int_const_subvector(
        v: *const gsl_vector_int,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_vector_int_const_subvector_with_stride(
        v: *const gsl_vector_int,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_vector_int_set_zero(v: *mut gsl_vector_int);
}
extern "C" {
    pub fn gsl_vector_int_set_all(v: *mut gsl_vector_int, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn gsl_vector_int_set_basis(v: *mut gsl_vector_int, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_fread(stream: *mut FILE, v: *mut gsl_vector_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_int,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_memcpy(
        dest: *mut gsl_vector_int,
        src: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_reverse(v: *mut gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_swap(
        v: *mut gsl_vector_int,
        w: *mut gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_swap_elements(
        v: *mut gsl_vector_int,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_max(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_min(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_minmax(
        v: *const gsl_vector_int,
        min_out: *mut ::std::os::raw::c_int,
        max_out: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn gsl_vector_int_max_index(v: *const gsl_vector_int) -> size_t;
}
extern "C" {
    pub fn gsl_vector_int_min_index(v: *const gsl_vector_int) -> size_t;
}
extern "C" {
    pub fn gsl_vector_int_minmax_index(
        v: *const gsl_vector_int,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_int_add(
        a: *mut gsl_vector_int,
        b: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_sub(
        a: *mut gsl_vector_int,
        b: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_mul(
        a: *mut gsl_vector_int,
        b: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_div(
        a: *mut gsl_vector_int,
        b: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_scale(
        a: *mut gsl_vector_int,
        x: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_add_constant(
        a: *mut gsl_vector_int,
        x: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_axpby(
        alpha: ::std::os::raw::c_int,
        x: *const gsl_vector_int,
        beta: ::std::os::raw::c_int,
        y: *mut gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_sum(a: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_equal(
        u: *const gsl_vector_int,
        v: *const gsl_vector_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_isnull(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_ispos(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_isneg(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_isnonneg(v: *const gsl_vector_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_get(v: *const gsl_vector_int, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_set(v: *mut gsl_vector_int, i: size_t, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn gsl_vector_int_ptr(v: *mut gsl_vector_int, i: size_t) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_int_const_ptr(
        v: *const gsl_vector_int,
        i: size_t,
    ) -> *const ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_ushort_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_gsl_block_ushort_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_ushort_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_ushort_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_ushort_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_ushort_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_ushort_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_ushort_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_ushort_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_ushort_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_ushort = gsl_block_ushort_struct;
extern "C" {
    pub fn gsl_block_ushort_alloc(n: size_t) -> *mut gsl_block_ushort;
}
extern "C" {
    pub fn gsl_block_ushort_calloc(n: size_t) -> *mut gsl_block_ushort;
}
extern "C" {
    pub fn gsl_block_ushort_free(b: *mut gsl_block_ushort);
}
extern "C" {
    pub fn gsl_block_ushort_fread(
        stream: *mut FILE,
        b: *mut gsl_block_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_ushort,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_ushort,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_ushort,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_ushort,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_ushort,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_ushort_size(b: *const gsl_block_ushort) -> size_t;
}
extern "C" {
    pub fn gsl_block_ushort_data(b: *const gsl_block_ushort) -> *mut ::std::os::raw::c_ushort;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_ushort {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_ushort,
    pub block: *mut gsl_block_ushort,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_ushort() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_ushort>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_ushort))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_ushort>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_ushort))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ushort>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ushort),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ushort>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ushort),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ushort>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ushort),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ushort>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ushort),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_ushort>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_ushort),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_ushort_view {
    pub vector: gsl_vector_ushort,
}
#[test]
fn bindgen_test_layout__gsl_vector_ushort_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_ushort_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_ushort_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_ushort_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_ushort_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_ushort_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_ushort_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_ushort_view = _gsl_vector_ushort_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_ushort_const_view {
    pub vector: gsl_vector_ushort,
}
#[test]
fn bindgen_test_layout__gsl_vector_ushort_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_ushort_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_ushort_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_ushort_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_ushort_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_ushort_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_ushort_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_ushort_const_view = _gsl_vector_ushort_const_view;
extern "C" {
    pub fn gsl_vector_ushort_alloc(n: size_t) -> *mut gsl_vector_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_calloc(n: size_t) -> *mut gsl_vector_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_alloc_from_block(
        b: *mut gsl_block_ushort,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_alloc_from_vector(
        v: *mut gsl_vector_ushort,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_free(v: *mut gsl_vector_ushort);
}
extern "C" {
    pub fn gsl_vector_ushort_view_array(
        v: *mut ::std::os::raw::c_ushort,
        n: size_t,
    ) -> _gsl_vector_ushort_view;
}
extern "C" {
    pub fn gsl_vector_ushort_view_array_with_stride(
        base: *mut ::std::os::raw::c_ushort,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_view;
}
extern "C" {
    pub fn gsl_vector_ushort_const_view_array(
        v: *const ::std::os::raw::c_ushort,
        n: size_t,
    ) -> _gsl_vector_ushort_const_view;
}
extern "C" {
    pub fn gsl_vector_ushort_const_view_array_with_stride(
        base: *const ::std::os::raw::c_ushort,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_const_view;
}
extern "C" {
    pub fn gsl_vector_ushort_subvector(
        v: *mut gsl_vector_ushort,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_view;
}
extern "C" {
    pub fn gsl_vector_ushort_subvector_with_stride(
        v: *mut gsl_vector_ushort,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_view;
}
extern "C" {
    pub fn gsl_vector_ushort_const_subvector(
        v: *const gsl_vector_ushort,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_const_view;
}
extern "C" {
    pub fn gsl_vector_ushort_const_subvector_with_stride(
        v: *const gsl_vector_ushort,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_ushort_const_view;
}
extern "C" {
    pub fn gsl_vector_ushort_set_zero(v: *mut gsl_vector_ushort);
}
extern "C" {
    pub fn gsl_vector_ushort_set_all(v: *mut gsl_vector_ushort, x: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn gsl_vector_ushort_set_basis(
        v: *mut gsl_vector_ushort,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_ushort,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_memcpy(
        dest: *mut gsl_vector_ushort,
        src: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_reverse(v: *mut gsl_vector_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_swap(
        v: *mut gsl_vector_ushort,
        w: *mut gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_swap_elements(
        v: *mut gsl_vector_ushort,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_max(v: *const gsl_vector_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_min(v: *const gsl_vector_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_minmax(
        v: *const gsl_vector_ushort,
        min_out: *mut ::std::os::raw::c_ushort,
        max_out: *mut ::std::os::raw::c_ushort,
    );
}
extern "C" {
    pub fn gsl_vector_ushort_max_index(v: *const gsl_vector_ushort) -> size_t;
}
extern "C" {
    pub fn gsl_vector_ushort_min_index(v: *const gsl_vector_ushort) -> size_t;
}
extern "C" {
    pub fn gsl_vector_ushort_minmax_index(
        v: *const gsl_vector_ushort,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_ushort_add(
        a: *mut gsl_vector_ushort,
        b: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_sub(
        a: *mut gsl_vector_ushort,
        b: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_mul(
        a: *mut gsl_vector_ushort,
        b: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_div(
        a: *mut gsl_vector_ushort,
        b: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_scale(
        a: *mut gsl_vector_ushort,
        x: ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_add_constant(
        a: *mut gsl_vector_ushort,
        x: ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_axpby(
        alpha: ::std::os::raw::c_ushort,
        x: *const gsl_vector_ushort,
        beta: ::std::os::raw::c_ushort,
        y: *mut gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_sum(a: *const gsl_vector_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_equal(
        u: *const gsl_vector_ushort,
        v: *const gsl_vector_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_isnull(v: *const gsl_vector_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_ispos(v: *const gsl_vector_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_isneg(v: *const gsl_vector_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_isnonneg(v: *const gsl_vector_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_ushort_get(
        v: *const gsl_vector_ushort,
        i: size_t,
    ) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_set(v: *mut gsl_vector_ushort, i: size_t, x: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn gsl_vector_ushort_ptr(
        v: *mut gsl_vector_ushort,
        i: size_t,
    ) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn gsl_vector_ushort_const_ptr(
        v: *const gsl_vector_ushort,
        i: size_t,
    ) -> *const ::std::os::raw::c_ushort;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_short_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_gsl_block_short_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_short_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_short_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_short_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_short_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_short_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_short_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_short_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_short_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_short = gsl_block_short_struct;
extern "C" {
    pub fn gsl_block_short_alloc(n: size_t) -> *mut gsl_block_short;
}
extern "C" {
    pub fn gsl_block_short_calloc(n: size_t) -> *mut gsl_block_short;
}
extern "C" {
    pub fn gsl_block_short_free(b: *mut gsl_block_short);
}
extern "C" {
    pub fn gsl_block_short_fread(
        stream: *mut FILE,
        b: *mut gsl_block_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_short,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_short,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_short,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_short,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_short,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_short_size(b: *const gsl_block_short) -> size_t;
}
extern "C" {
    pub fn gsl_block_short_data(b: *const gsl_block_short) -> *mut ::std::os::raw::c_short;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_short {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_short,
    pub block: *mut gsl_block_short,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_short() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_short>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_short))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_short>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_short))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_short>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_short),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_short>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_short),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_short>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_short),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_short>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_short),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_short>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_short),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_short_view {
    pub vector: gsl_vector_short,
}
#[test]
fn bindgen_test_layout__gsl_vector_short_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_short_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_short_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_short_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_short_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_short_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_short_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_short_view = _gsl_vector_short_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_short_const_view {
    pub vector: gsl_vector_short,
}
#[test]
fn bindgen_test_layout__gsl_vector_short_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_short_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_short_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_short_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_short_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_short_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_short_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_short_const_view = _gsl_vector_short_const_view;
extern "C" {
    pub fn gsl_vector_short_alloc(n: size_t) -> *mut gsl_vector_short;
}
extern "C" {
    pub fn gsl_vector_short_calloc(n: size_t) -> *mut gsl_vector_short;
}
extern "C" {
    pub fn gsl_vector_short_alloc_from_block(
        b: *mut gsl_block_short,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_short;
}
extern "C" {
    pub fn gsl_vector_short_alloc_from_vector(
        v: *mut gsl_vector_short,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_short;
}
extern "C" {
    pub fn gsl_vector_short_free(v: *mut gsl_vector_short);
}
extern "C" {
    pub fn gsl_vector_short_view_array(
        v: *mut ::std::os::raw::c_short,
        n: size_t,
    ) -> _gsl_vector_short_view;
}
extern "C" {
    pub fn gsl_vector_short_view_array_with_stride(
        base: *mut ::std::os::raw::c_short,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_short_view;
}
extern "C" {
    pub fn gsl_vector_short_const_view_array(
        v: *const ::std::os::raw::c_short,
        n: size_t,
    ) -> _gsl_vector_short_const_view;
}
extern "C" {
    pub fn gsl_vector_short_const_view_array_with_stride(
        base: *const ::std::os::raw::c_short,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_short_const_view;
}
extern "C" {
    pub fn gsl_vector_short_subvector(
        v: *mut gsl_vector_short,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_short_view;
}
extern "C" {
    pub fn gsl_vector_short_subvector_with_stride(
        v: *mut gsl_vector_short,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_short_view;
}
extern "C" {
    pub fn gsl_vector_short_const_subvector(
        v: *const gsl_vector_short,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_short_const_view;
}
extern "C" {
    pub fn gsl_vector_short_const_subvector_with_stride(
        v: *const gsl_vector_short,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_short_const_view;
}
extern "C" {
    pub fn gsl_vector_short_set_zero(v: *mut gsl_vector_short);
}
extern "C" {
    pub fn gsl_vector_short_set_all(v: *mut gsl_vector_short, x: ::std::os::raw::c_short);
}
extern "C" {
    pub fn gsl_vector_short_set_basis(v: *mut gsl_vector_short, i: size_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_short,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_memcpy(
        dest: *mut gsl_vector_short,
        src: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_reverse(v: *mut gsl_vector_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_swap(
        v: *mut gsl_vector_short,
        w: *mut gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_swap_elements(
        v: *mut gsl_vector_short,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_max(v: *const gsl_vector_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn gsl_vector_short_min(v: *const gsl_vector_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn gsl_vector_short_minmax(
        v: *const gsl_vector_short,
        min_out: *mut ::std::os::raw::c_short,
        max_out: *mut ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn gsl_vector_short_max_index(v: *const gsl_vector_short) -> size_t;
}
extern "C" {
    pub fn gsl_vector_short_min_index(v: *const gsl_vector_short) -> size_t;
}
extern "C" {
    pub fn gsl_vector_short_minmax_index(
        v: *const gsl_vector_short,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_short_add(
        a: *mut gsl_vector_short,
        b: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_sub(
        a: *mut gsl_vector_short,
        b: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_mul(
        a: *mut gsl_vector_short,
        b: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_div(
        a: *mut gsl_vector_short,
        b: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_scale(
        a: *mut gsl_vector_short,
        x: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_add_constant(
        a: *mut gsl_vector_short,
        x: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_axpby(
        alpha: ::std::os::raw::c_short,
        x: *const gsl_vector_short,
        beta: ::std::os::raw::c_short,
        y: *mut gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_sum(a: *const gsl_vector_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn gsl_vector_short_equal(
        u: *const gsl_vector_short,
        v: *const gsl_vector_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_isnull(v: *const gsl_vector_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_ispos(v: *const gsl_vector_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_isneg(v: *const gsl_vector_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_isnonneg(v: *const gsl_vector_short) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_short_get(v: *const gsl_vector_short, i: size_t) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn gsl_vector_short_set(v: *mut gsl_vector_short, i: size_t, x: ::std::os::raw::c_short);
}
extern "C" {
    pub fn gsl_vector_short_ptr(
        v: *mut gsl_vector_short,
        i: size_t,
    ) -> *mut ::std::os::raw::c_short;
}
extern "C" {
    pub fn gsl_vector_short_const_ptr(
        v: *const gsl_vector_short,
        i: size_t,
    ) -> *const ::std::os::raw::c_short;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_uchar_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_gsl_block_uchar_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_uchar_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_uchar_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_uchar_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_uchar_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_uchar_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_uchar_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_uchar_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_uchar_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_uchar = gsl_block_uchar_struct;
extern "C" {
    pub fn gsl_block_uchar_alloc(n: size_t) -> *mut gsl_block_uchar;
}
extern "C" {
    pub fn gsl_block_uchar_calloc(n: size_t) -> *mut gsl_block_uchar;
}
extern "C" {
    pub fn gsl_block_uchar_free(b: *mut gsl_block_uchar);
}
extern "C" {
    pub fn gsl_block_uchar_fread(
        stream: *mut FILE,
        b: *mut gsl_block_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_uchar,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_uchar,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_uchar,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_uchar,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_uchar,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_uchar_size(b: *const gsl_block_uchar) -> size_t;
}
extern "C" {
    pub fn gsl_block_uchar_data(b: *const gsl_block_uchar) -> *mut ::std::os::raw::c_uchar;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_uchar {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_uchar,
    pub block: *mut gsl_block_uchar,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_uchar() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_uchar>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uchar>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uchar),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uchar>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uchar),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uchar>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uchar),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uchar>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uchar),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_uchar>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_uchar),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_uchar_view {
    pub vector: gsl_vector_uchar,
}
#[test]
fn bindgen_test_layout__gsl_vector_uchar_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_uchar_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_uchar_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_uchar_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_uchar_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_uchar_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_uchar_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_uchar_view = _gsl_vector_uchar_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_uchar_const_view {
    pub vector: gsl_vector_uchar,
}
#[test]
fn bindgen_test_layout__gsl_vector_uchar_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_uchar_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_uchar_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_uchar_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_uchar_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_uchar_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_uchar_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_uchar_const_view = _gsl_vector_uchar_const_view;
extern "C" {
    pub fn gsl_vector_uchar_alloc(n: size_t) -> *mut gsl_vector_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_calloc(n: size_t) -> *mut gsl_vector_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_alloc_from_block(
        b: *mut gsl_block_uchar,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_alloc_from_vector(
        v: *mut gsl_vector_uchar,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_free(v: *mut gsl_vector_uchar);
}
extern "C" {
    pub fn gsl_vector_uchar_view_array(
        v: *mut ::std::os::raw::c_uchar,
        n: size_t,
    ) -> _gsl_vector_uchar_view;
}
extern "C" {
    pub fn gsl_vector_uchar_view_array_with_stride(
        base: *mut ::std::os::raw::c_uchar,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_view;
}
extern "C" {
    pub fn gsl_vector_uchar_const_view_array(
        v: *const ::std::os::raw::c_uchar,
        n: size_t,
    ) -> _gsl_vector_uchar_const_view;
}
extern "C" {
    pub fn gsl_vector_uchar_const_view_array_with_stride(
        base: *const ::std::os::raw::c_uchar,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_const_view;
}
extern "C" {
    pub fn gsl_vector_uchar_subvector(
        v: *mut gsl_vector_uchar,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_view;
}
extern "C" {
    pub fn gsl_vector_uchar_subvector_with_stride(
        v: *mut gsl_vector_uchar,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_view;
}
extern "C" {
    pub fn gsl_vector_uchar_const_subvector(
        v: *const gsl_vector_uchar,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_const_view;
}
extern "C" {
    pub fn gsl_vector_uchar_const_subvector_with_stride(
        v: *const gsl_vector_uchar,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_uchar_const_view;
}
extern "C" {
    pub fn gsl_vector_uchar_set_zero(v: *mut gsl_vector_uchar);
}
extern "C" {
    pub fn gsl_vector_uchar_set_all(v: *mut gsl_vector_uchar, x: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn gsl_vector_uchar_set_basis(v: *mut gsl_vector_uchar, i: size_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_uchar,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_memcpy(
        dest: *mut gsl_vector_uchar,
        src: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_reverse(v: *mut gsl_vector_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_swap(
        v: *mut gsl_vector_uchar,
        w: *mut gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_swap_elements(
        v: *mut gsl_vector_uchar,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_max(v: *const gsl_vector_uchar) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_min(v: *const gsl_vector_uchar) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_minmax(
        v: *const gsl_vector_uchar,
        min_out: *mut ::std::os::raw::c_uchar,
        max_out: *mut ::std::os::raw::c_uchar,
    );
}
extern "C" {
    pub fn gsl_vector_uchar_max_index(v: *const gsl_vector_uchar) -> size_t;
}
extern "C" {
    pub fn gsl_vector_uchar_min_index(v: *const gsl_vector_uchar) -> size_t;
}
extern "C" {
    pub fn gsl_vector_uchar_minmax_index(
        v: *const gsl_vector_uchar,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_uchar_add(
        a: *mut gsl_vector_uchar,
        b: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_sub(
        a: *mut gsl_vector_uchar,
        b: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_mul(
        a: *mut gsl_vector_uchar,
        b: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_div(
        a: *mut gsl_vector_uchar,
        b: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_scale(
        a: *mut gsl_vector_uchar,
        x: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_add_constant(
        a: *mut gsl_vector_uchar,
        x: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_axpby(
        alpha: ::std::os::raw::c_uchar,
        x: *const gsl_vector_uchar,
        beta: ::std::os::raw::c_uchar,
        y: *mut gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_sum(a: *const gsl_vector_uchar) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_equal(
        u: *const gsl_vector_uchar,
        v: *const gsl_vector_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_isnull(v: *const gsl_vector_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_ispos(v: *const gsl_vector_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_isneg(v: *const gsl_vector_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_isnonneg(v: *const gsl_vector_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_uchar_get(v: *const gsl_vector_uchar, i: size_t) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_set(v: *mut gsl_vector_uchar, i: size_t, x: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn gsl_vector_uchar_ptr(
        v: *mut gsl_vector_uchar,
        i: size_t,
    ) -> *mut ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn gsl_vector_uchar_const_ptr(
        v: *const gsl_vector_uchar,
        i: size_t,
    ) -> *const ::std::os::raw::c_uchar;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_block_char_struct {
    pub size: size_t,
    pub data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_gsl_block_char_struct() {
    assert_eq!(
        ::std::mem::size_of::<gsl_block_char_struct>(),
        16usize,
        concat!("Size of: ", stringify!(gsl_block_char_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_block_char_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_block_char_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_char_struct>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_char_struct),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_block_char_struct>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_block_char_struct),
            "::",
            stringify!(data)
        )
    );
}
pub type gsl_block_char = gsl_block_char_struct;
extern "C" {
    pub fn gsl_block_char_alloc(n: size_t) -> *mut gsl_block_char;
}
extern "C" {
    pub fn gsl_block_char_calloc(n: size_t) -> *mut gsl_block_char;
}
extern "C" {
    pub fn gsl_block_char_free(b: *mut gsl_block_char);
}
extern "C" {
    pub fn gsl_block_char_fread(stream: *mut FILE, b: *mut gsl_block_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_fwrite(
        stream: *mut FILE,
        b: *const gsl_block_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_fscanf(
        stream: *mut FILE,
        b: *mut gsl_block_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_fprintf(
        stream: *mut FILE,
        b: *const gsl_block_char,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_raw_fread(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_char,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_raw_fwrite(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_char,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_raw_fscanf(
        stream: *mut FILE,
        b: *mut ::std::os::raw::c_char,
        n: size_t,
        stride: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_raw_fprintf(
        stream: *mut FILE,
        b: *const ::std::os::raw::c_char,
        n: size_t,
        stride: size_t,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_block_char_size(b: *const gsl_block_char) -> size_t;
}
extern "C" {
    pub fn gsl_block_char_data(b: *const gsl_block_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_vector_char {
    pub size: size_t,
    pub stride: size_t,
    pub data: *mut ::std::os::raw::c_char,
    pub block: *mut gsl_block_char,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_vector_char() {
    assert_eq!(
        ::std::mem::size_of::<gsl_vector_char>(),
        40usize,
        concat!("Size of: ", stringify!(gsl_vector_char))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_vector_char>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_vector_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_char>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_char),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_char>())).stride as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_char),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_char>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_char),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_char>())).block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_char),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_vector_char>())).owner as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_vector_char),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_char_view {
    pub vector: gsl_vector_char,
}
#[test]
fn bindgen_test_layout__gsl_vector_char_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_char_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_char_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_char_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_char_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_vector_char_view>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_char_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_char_view = _gsl_vector_char_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_vector_char_const_view {
    pub vector: gsl_vector_char,
}
#[test]
fn bindgen_test_layout__gsl_vector_char_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_vector_char_const_view>(),
        40usize,
        concat!("Size of: ", stringify!(_gsl_vector_char_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_vector_char_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_vector_char_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_vector_char_const_view>())).vector as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_vector_char_const_view),
            "::",
            stringify!(vector)
        )
    );
}
pub type gsl_vector_char_const_view = _gsl_vector_char_const_view;
extern "C" {
    pub fn gsl_vector_char_alloc(n: size_t) -> *mut gsl_vector_char;
}
extern "C" {
    pub fn gsl_vector_char_calloc(n: size_t) -> *mut gsl_vector_char;
}
extern "C" {
    pub fn gsl_vector_char_alloc_from_block(
        b: *mut gsl_block_char,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_char;
}
extern "C" {
    pub fn gsl_vector_char_alloc_from_vector(
        v: *mut gsl_vector_char,
        offset: size_t,
        n: size_t,
        stride: size_t,
    ) -> *mut gsl_vector_char;
}
extern "C" {
    pub fn gsl_vector_char_free(v: *mut gsl_vector_char);
}
extern "C" {
    pub fn gsl_vector_char_view_array(
        v: *mut ::std::os::raw::c_char,
        n: size_t,
    ) -> _gsl_vector_char_view;
}
extern "C" {
    pub fn gsl_vector_char_view_array_with_stride(
        base: *mut ::std::os::raw::c_char,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_char_view;
}
extern "C" {
    pub fn gsl_vector_char_const_view_array(
        v: *const ::std::os::raw::c_char,
        n: size_t,
    ) -> _gsl_vector_char_const_view;
}
extern "C" {
    pub fn gsl_vector_char_const_view_array_with_stride(
        base: *const ::std::os::raw::c_char,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_char_const_view;
}
extern "C" {
    pub fn gsl_vector_char_subvector(
        v: *mut gsl_vector_char,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_char_view;
}
extern "C" {
    pub fn gsl_vector_char_subvector_with_stride(
        v: *mut gsl_vector_char,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_char_view;
}
extern "C" {
    pub fn gsl_vector_char_const_subvector(
        v: *const gsl_vector_char,
        i: size_t,
        n: size_t,
    ) -> _gsl_vector_char_const_view;
}
extern "C" {
    pub fn gsl_vector_char_const_subvector_with_stride(
        v: *const gsl_vector_char,
        i: size_t,
        stride: size_t,
        n: size_t,
    ) -> _gsl_vector_char_const_view;
}
extern "C" {
    pub fn gsl_vector_char_set_zero(v: *mut gsl_vector_char);
}
extern "C" {
    pub fn gsl_vector_char_set_all(v: *mut gsl_vector_char, x: ::std::os::raw::c_char);
}
extern "C" {
    pub fn gsl_vector_char_set_basis(v: *mut gsl_vector_char, i: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_fread(
        stream: *mut FILE,
        v: *mut gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_fwrite(
        stream: *mut FILE,
        v: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_fscanf(
        stream: *mut FILE,
        v: *mut gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_fprintf(
        stream: *mut FILE,
        v: *const gsl_vector_char,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_memcpy(
        dest: *mut gsl_vector_char,
        src: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_reverse(v: *mut gsl_vector_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_swap(
        v: *mut gsl_vector_char,
        w: *mut gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_swap_elements(
        v: *mut gsl_vector_char,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_max(v: *const gsl_vector_char) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn gsl_vector_char_min(v: *const gsl_vector_char) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn gsl_vector_char_minmax(
        v: *const gsl_vector_char,
        min_out: *mut ::std::os::raw::c_char,
        max_out: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn gsl_vector_char_max_index(v: *const gsl_vector_char) -> size_t;
}
extern "C" {
    pub fn gsl_vector_char_min_index(v: *const gsl_vector_char) -> size_t;
}
extern "C" {
    pub fn gsl_vector_char_minmax_index(
        v: *const gsl_vector_char,
        imin: *mut size_t,
        imax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_vector_char_add(
        a: *mut gsl_vector_char,
        b: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_sub(
        a: *mut gsl_vector_char,
        b: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_mul(
        a: *mut gsl_vector_char,
        b: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_div(
        a: *mut gsl_vector_char,
        b: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_scale(
        a: *mut gsl_vector_char,
        x: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_add_constant(
        a: *mut gsl_vector_char,
        x: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_axpby(
        alpha: ::std::os::raw::c_char,
        x: *const gsl_vector_char,
        beta: ::std::os::raw::c_char,
        y: *mut gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_sum(a: *const gsl_vector_char) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn gsl_vector_char_equal(
        u: *const gsl_vector_char,
        v: *const gsl_vector_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_isnull(v: *const gsl_vector_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_ispos(v: *const gsl_vector_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_isneg(v: *const gsl_vector_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_isnonneg(v: *const gsl_vector_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_vector_char_get(v: *const gsl_vector_char, i: size_t) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn gsl_vector_char_set(v: *mut gsl_vector_char, i: size_t, x: ::std::os::raw::c_char);
}
extern "C" {
    pub fn gsl_vector_char_ptr(v: *mut gsl_vector_char, i: size_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gsl_vector_char_const_ptr(
        v: *const gsl_vector_char,
        i: size_t,
    ) -> *const ::std::os::raw::c_char;
}
pub const CBLAS_TRANSPOSE_CblasNoTrans: CBLAS_TRANSPOSE = 111;
pub const CBLAS_TRANSPOSE_CblasTrans: CBLAS_TRANSPOSE = 112;
pub const CBLAS_TRANSPOSE_CblasConjTrans: CBLAS_TRANSPOSE = 113;
pub type CBLAS_TRANSPOSE = ::std::os::raw::c_uint;
pub const CBLAS_UPLO_CblasUpper: CBLAS_UPLO = 121;
pub const CBLAS_UPLO_CblasLower: CBLAS_UPLO = 122;
pub type CBLAS_UPLO = ::std::os::raw::c_uint;
pub const CBLAS_DIAG_CblasNonUnit: CBLAS_DIAG = 131;
pub const CBLAS_DIAG_CblasUnit: CBLAS_DIAG = 132;
pub type CBLAS_DIAG = ::std::os::raw::c_uint;
pub const CBLAS_SIDE_CblasLeft: CBLAS_SIDE = 141;
pub const CBLAS_SIDE_CblasRight: CBLAS_SIDE = 142;
pub type CBLAS_SIDE = ::std::os::raw::c_uint;
pub type CBLAS_INDEX_t = size_t;
pub use self::CBLAS_DIAG as CBLAS_DIAG_t;
pub use self::CBLAS_SIDE as CBLAS_SIDE_t;
pub use self::CBLAS_TRANSPOSE as CBLAS_TRANSPOSE_t;
pub use self::CBLAS_UPLO as CBLAS_UPLO_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_complex {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut f64,
    pub block: *mut gsl_block_complex,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_complex() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_complex>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_complex))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_complex>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_complex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_complex_view {
    pub matrix: gsl_matrix_complex,
}
#[test]
fn bindgen_test_layout__gsl_matrix_complex_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_complex_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_complex_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_complex_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_complex_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_complex_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_complex_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_complex_view = _gsl_matrix_complex_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_complex_const_view {
    pub matrix: gsl_matrix_complex,
}
#[test]
fn bindgen_test_layout__gsl_matrix_complex_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_complex_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_complex_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_complex_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_complex_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_complex_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_complex_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_complex_const_view = _gsl_matrix_complex_const_view;
extern "C" {
    pub fn gsl_matrix_complex_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_alloc_from_block(
        b: *mut gsl_block_complex,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_alloc_from_matrix(
        b: *mut gsl_matrix_complex,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_complex;
}
extern "C" {
    pub fn gsl_vector_complex_alloc_row_from_matrix(
        m: *mut gsl_matrix_complex,
        i: size_t,
    ) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_vector_complex_alloc_col_from_matrix(
        m: *mut gsl_matrix_complex,
        j: size_t,
    ) -> *mut gsl_vector_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_free(m: *mut gsl_matrix_complex);
}
extern "C" {
    pub fn gsl_matrix_complex_submatrix(
        m: *mut gsl_matrix_complex,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_row(
        m: *mut gsl_matrix_complex,
        i: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_column(
        m: *mut gsl_matrix_complex,
        j: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_diagonal(m: *mut gsl_matrix_complex) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_subdiagonal(
        m: *mut gsl_matrix_complex,
        k: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_superdiagonal(
        m: *mut gsl_matrix_complex,
        k: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_subrow(
        m: *mut gsl_matrix_complex,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_subcolumn(
        m: *mut gsl_matrix_complex,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_view_array(
        base: *mut f64,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_view_array_with_tda(
        base: *mut f64,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_view_vector(
        v: *mut gsl_vector_complex,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_view_vector_with_tda(
        v: *mut gsl_vector_complex,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_submatrix(
        m: *const gsl_matrix_complex,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_row(
        m: *const gsl_matrix_complex,
        i: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_column(
        m: *const gsl_matrix_complex,
        j: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_diagonal(
        m: *const gsl_matrix_complex,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_subdiagonal(
        m: *const gsl_matrix_complex,
        k: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_superdiagonal(
        m: *const gsl_matrix_complex,
        k: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_subrow(
        m: *const gsl_matrix_complex,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_subcolumn(
        m: *const gsl_matrix_complex,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_view_array(
        base: *const f64,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_view_array_with_tda(
        base: *const f64,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_view_vector(
        v: *const gsl_vector_complex,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_const_view_vector_with_tda(
        v: *const gsl_vector_complex,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_set_zero(m: *mut gsl_matrix_complex);
}
extern "C" {
    pub fn gsl_matrix_complex_set_identity(m: *mut gsl_matrix_complex);
}
extern "C" {
    pub fn gsl_matrix_complex_set_all(m: *mut gsl_matrix_complex, x: gsl_complex);
}
extern "C" {
    pub fn gsl_matrix_complex_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_complex,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_memcpy(
        dest: *mut gsl_matrix_complex,
        src: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_swap(
        m1: *mut gsl_matrix_complex,
        m2: *mut gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_complex,
        src: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_swap_rows(
        m: *mut gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_swap_columns(
        m: *mut gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_swap_rowcol(
        m: *mut gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_transpose(m: *mut gsl_matrix_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_transpose_memcpy(
        dest: *mut gsl_matrix_complex,
        src: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_complex,
        src: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_conjtrans_memcpy(
        dest: *mut gsl_matrix_complex,
        src: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_equal(
        a: *const gsl_matrix_complex,
        b: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_isnull(m: *const gsl_matrix_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_ispos(m: *const gsl_matrix_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_isneg(m: *const gsl_matrix_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_isnonneg(m: *const gsl_matrix_complex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_add(
        a: *mut gsl_matrix_complex,
        b: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_sub(
        a: *mut gsl_matrix_complex,
        b: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_mul_elements(
        a: *mut gsl_matrix_complex,
        b: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_div_elements(
        a: *mut gsl_matrix_complex,
        b: *const gsl_matrix_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_scale(
        a: *mut gsl_matrix_complex,
        x: gsl_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_scale_rows(
        a: *mut gsl_matrix_complex,
        x: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_scale_columns(
        a: *mut gsl_matrix_complex,
        x: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_add_constant(
        a: *mut gsl_matrix_complex,
        x: gsl_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_add_diagonal(
        a: *mut gsl_matrix_complex,
        x: gsl_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_get_row(
        v: *mut gsl_vector_complex,
        m: *const gsl_matrix_complex,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_get_col(
        v: *mut gsl_vector_complex,
        m: *const gsl_matrix_complex,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_set_row(
        m: *mut gsl_matrix_complex,
        i: size_t,
        v: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_set_col(
        m: *mut gsl_matrix_complex,
        j: size_t,
        v: *const gsl_vector_complex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_get(
        m: *const gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> gsl_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_set(m: *mut gsl_matrix_complex, i: size_t, j: size_t, x: gsl_complex);
}
extern "C" {
    pub fn gsl_matrix_complex_ptr(
        m: *mut gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> *mut gsl_complex;
}
extern "C" {
    pub fn gsl_matrix_complex_const_ptr(
        m: *const gsl_matrix_complex,
        i: size_t,
        j: size_t,
    ) -> *const gsl_complex;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_complex_float {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut f32,
    pub block: *mut gsl_block_complex_float,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_complex_float() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_complex_float>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_complex_float))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_complex_float>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_complex_float))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_complex_float>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_complex_float),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_complex_float_view {
    pub matrix: gsl_matrix_complex_float,
}
#[test]
fn bindgen_test_layout__gsl_matrix_complex_float_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_complex_float_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_complex_float_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_complex_float_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_complex_float_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_complex_float_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_complex_float_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_complex_float_view = _gsl_matrix_complex_float_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_complex_float_const_view {
    pub matrix: gsl_matrix_complex_float,
}
#[test]
fn bindgen_test_layout__gsl_matrix_complex_float_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_complex_float_const_view>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(_gsl_matrix_complex_float_const_view)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_complex_float_const_view>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_gsl_matrix_complex_float_const_view)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_complex_float_const_view>())).matrix as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_complex_float_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_complex_float_const_view = _gsl_matrix_complex_float_const_view;
extern "C" {
    pub fn gsl_matrix_complex_float_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_calloc(n1: size_t, n2: size_t)
        -> *mut gsl_matrix_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_alloc_from_block(
        b: *mut gsl_block_complex_float,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_alloc_from_matrix(
        b: *mut gsl_matrix_complex_float,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_alloc_row_from_matrix(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
    ) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_vector_complex_float_alloc_col_from_matrix(
        m: *mut gsl_matrix_complex_float,
        j: size_t,
    ) -> *mut gsl_vector_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_free(m: *mut gsl_matrix_complex_float);
}
extern "C" {
    pub fn gsl_matrix_complex_float_submatrix(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_row(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_column(
        m: *mut gsl_matrix_complex_float,
        j: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_diagonal(
        m: *mut gsl_matrix_complex_float,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_subdiagonal(
        m: *mut gsl_matrix_complex_float,
        k: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_superdiagonal(
        m: *mut gsl_matrix_complex_float,
        k: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_subrow(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_subcolumn(
        m: *mut gsl_matrix_complex_float,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_view_array(
        base: *mut f32,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_view_array_with_tda(
        base: *mut f32,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_view_vector(
        v: *mut gsl_vector_complex_float,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_view_vector_with_tda(
        v: *mut gsl_vector_complex_float,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_float_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_submatrix(
        m: *const gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_row(
        m: *const gsl_matrix_complex_float,
        i: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_column(
        m: *const gsl_matrix_complex_float,
        j: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_diagonal(
        m: *const gsl_matrix_complex_float,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_subdiagonal(
        m: *const gsl_matrix_complex_float,
        k: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_superdiagonal(
        m: *const gsl_matrix_complex_float,
        k: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_subrow(
        m: *const gsl_matrix_complex_float,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_subcolumn(
        m: *const gsl_matrix_complex_float,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_view_array(
        base: *const f32,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_view_array_with_tda(
        base: *const f32,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_view_vector(
        v: *const gsl_vector_complex_float,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_view_vector_with_tda(
        v: *const gsl_vector_complex_float,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_complex_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_complex_float_set_zero(m: *mut gsl_matrix_complex_float);
}
extern "C" {
    pub fn gsl_matrix_complex_float_set_identity(m: *mut gsl_matrix_complex_float);
}
extern "C" {
    pub fn gsl_matrix_complex_float_set_all(m: *mut gsl_matrix_complex_float, x: gsl_complex_float);
}
extern "C" {
    pub fn gsl_matrix_complex_float_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_complex_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_memcpy(
        dest: *mut gsl_matrix_complex_float,
        src: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_swap(
        m1: *mut gsl_matrix_complex_float,
        m2: *mut gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_complex_float,
        src: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_swap_rows(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_swap_columns(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_swap_rowcol(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_transpose(
        m: *mut gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_transpose_memcpy(
        dest: *mut gsl_matrix_complex_float,
        src: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_complex_float,
        src: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_conjtrans_memcpy(
        dest: *mut gsl_matrix_complex_float,
        src: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_equal(
        a: *const gsl_matrix_complex_float,
        b: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_isnull(
        m: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_ispos(
        m: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_isneg(
        m: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_isnonneg(
        m: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_add(
        a: *mut gsl_matrix_complex_float,
        b: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_sub(
        a: *mut gsl_matrix_complex_float,
        b: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_mul_elements(
        a: *mut gsl_matrix_complex_float,
        b: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_div_elements(
        a: *mut gsl_matrix_complex_float,
        b: *const gsl_matrix_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_scale(
        a: *mut gsl_matrix_complex_float,
        x: gsl_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_scale_rows(
        a: *mut gsl_matrix_complex_float,
        x: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_scale_columns(
        a: *mut gsl_matrix_complex_float,
        x: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_add_constant(
        a: *mut gsl_matrix_complex_float,
        x: gsl_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_add_diagonal(
        a: *mut gsl_matrix_complex_float,
        x: gsl_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_get_row(
        v: *mut gsl_vector_complex_float,
        m: *const gsl_matrix_complex_float,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_get_col(
        v: *mut gsl_vector_complex_float,
        m: *const gsl_matrix_complex_float,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_set_row(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_set_col(
        m: *mut gsl_matrix_complex_float,
        j: size_t,
        v: *const gsl_vector_complex_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_complex_float_get(
        m: *const gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> gsl_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_set(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
        x: gsl_complex_float,
    );
}
extern "C" {
    pub fn gsl_matrix_complex_float_ptr(
        m: *mut gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> *mut gsl_complex_float;
}
extern "C" {
    pub fn gsl_matrix_complex_float_const_ptr(
        m: *const gsl_matrix_complex_float,
        i: size_t,
        j: size_t,
    ) -> *const gsl_complex_float;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut f64,
    pub block: *mut gsl_block,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_view {
    pub matrix: gsl_matrix,
}
#[test]
fn bindgen_test_layout__gsl_matrix_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_view = _gsl_matrix_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_const_view {
    pub matrix: gsl_matrix,
}
#[test]
fn bindgen_test_layout__gsl_matrix_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_const_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_const_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_const_view = _gsl_matrix_const_view;
extern "C" {
    pub fn gsl_matrix_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix;
}
extern "C" {
    pub fn gsl_matrix_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix;
}
extern "C" {
    pub fn gsl_matrix_alloc_from_block(
        b: *mut gsl_block,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix;
}
extern "C" {
    pub fn gsl_matrix_alloc_from_matrix(
        m: *mut gsl_matrix,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix;
}
extern "C" {
    pub fn gsl_vector_alloc_row_from_matrix(m: *mut gsl_matrix, i: size_t) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_vector_alloc_col_from_matrix(m: *mut gsl_matrix, j: size_t) -> *mut gsl_vector;
}
extern "C" {
    pub fn gsl_matrix_free(m: *mut gsl_matrix);
}
extern "C" {
    pub fn gsl_matrix_submatrix(
        m: *mut gsl_matrix,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_view;
}
extern "C" {
    pub fn gsl_matrix_row(m: *mut gsl_matrix, i: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_column(m: *mut gsl_matrix, j: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_diagonal(m: *mut gsl_matrix) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_subdiagonal(m: *mut gsl_matrix, k: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_superdiagonal(m: *mut gsl_matrix, k: size_t) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_subrow(
        m: *mut gsl_matrix,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_subcolumn(
        m: *mut gsl_matrix,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_view;
}
extern "C" {
    pub fn gsl_matrix_view_array(base: *mut f64, n1: size_t, n2: size_t) -> _gsl_matrix_view;
}
extern "C" {
    pub fn gsl_matrix_view_array_with_tda(
        base: *mut f64,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_view;
}
extern "C" {
    pub fn gsl_matrix_view_vector(v: *mut gsl_vector, n1: size_t, n2: size_t) -> _gsl_matrix_view;
}
extern "C" {
    pub fn gsl_matrix_view_vector_with_tda(
        v: *mut gsl_vector,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_view;
}
extern "C" {
    pub fn gsl_matrix_const_submatrix(
        m: *const gsl_matrix,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_row(m: *const gsl_matrix, i: size_t) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_column(m: *const gsl_matrix, j: size_t) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_diagonal(m: *const gsl_matrix) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_subdiagonal(m: *const gsl_matrix, k: size_t) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_superdiagonal(
        m: *const gsl_matrix,
        k: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_subrow(
        m: *const gsl_matrix,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_subcolumn(
        m: *const gsl_matrix,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_view_array(
        base: *const f64,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_view_array_with_tda(
        base: *const f64,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_view_vector(
        v: *const gsl_vector,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_const_view;
}
extern "C" {
    pub fn gsl_matrix_const_view_vector_with_tda(
        v: *const gsl_vector,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_const_view;
}
extern "C" {
    pub fn gsl_matrix_set_zero(m: *mut gsl_matrix);
}
extern "C" {
    pub fn gsl_matrix_set_identity(m: *mut gsl_matrix);
}
extern "C" {
    pub fn gsl_matrix_set_all(m: *mut gsl_matrix, x: f64);
}
extern "C" {
    pub fn gsl_matrix_fread(stream: *mut FILE, m: *mut gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_fwrite(stream: *mut FILE, m: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_fscanf(stream: *mut FILE, m: *mut gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_memcpy(
        dest: *mut gsl_matrix,
        src: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_swap(m1: *mut gsl_matrix, m2: *mut gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix,
        src: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_swap_rows(m: *mut gsl_matrix, i: size_t, j: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_swap_columns(
        m: *mut gsl_matrix,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_swap_rowcol(
        m: *mut gsl_matrix,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_transpose(m: *mut gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_transpose_memcpy(
        dest: *mut gsl_matrix,
        src: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix,
        src: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_max(m: *const gsl_matrix) -> f64;
}
extern "C" {
    pub fn gsl_matrix_min(m: *const gsl_matrix) -> f64;
}
extern "C" {
    pub fn gsl_matrix_minmax(m: *const gsl_matrix, min_out: *mut f64, max_out: *mut f64);
}
extern "C" {
    pub fn gsl_matrix_max_index(m: *const gsl_matrix, imax: *mut size_t, jmax: *mut size_t);
}
extern "C" {
    pub fn gsl_matrix_min_index(m: *const gsl_matrix, imin: *mut size_t, jmin: *mut size_t);
}
extern "C" {
    pub fn gsl_matrix_minmax_index(
        m: *const gsl_matrix,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_equal(a: *const gsl_matrix, b: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_isnull(m: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ispos(m: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_isneg(m: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_isnonneg(m: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_norm1(m: *const gsl_matrix) -> f64;
}
extern "C" {
    pub fn gsl_matrix_add(a: *mut gsl_matrix, b: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_sub(a: *mut gsl_matrix, b: *const gsl_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_mul_elements(
        a: *mut gsl_matrix,
        b: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_div_elements(
        a: *mut gsl_matrix,
        b: *const gsl_matrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_scale(a: *mut gsl_matrix, x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_scale_rows(a: *mut gsl_matrix, x: *const gsl_vector)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_scale_columns(
        a: *mut gsl_matrix,
        x: *const gsl_vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_add_constant(a: *mut gsl_matrix, x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_add_diagonal(a: *mut gsl_matrix, x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_get_row(
        v: *mut gsl_vector,
        m: *const gsl_matrix,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_get_col(
        v: *mut gsl_vector,
        m: *const gsl_matrix,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_set_row(
        m: *mut gsl_matrix,
        i: size_t,
        v: *const gsl_vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_set_col(
        m: *mut gsl_matrix,
        j: size_t,
        v: *const gsl_vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_get(m: *const gsl_matrix, i: size_t, j: size_t) -> f64;
}
extern "C" {
    pub fn gsl_matrix_set(m: *mut gsl_matrix, i: size_t, j: size_t, x: f64);
}
extern "C" {
    pub fn gsl_matrix_ptr(m: *mut gsl_matrix, i: size_t, j: size_t) -> *mut f64;
}
extern "C" {
    pub fn gsl_matrix_const_ptr(m: *const gsl_matrix, i: size_t, j: size_t) -> *const f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_float {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut f32,
    pub block: *mut gsl_block_float,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_float() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_float>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_float))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_float>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_float))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_float>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_float),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_float_view {
    pub matrix: gsl_matrix_float,
}
#[test]
fn bindgen_test_layout__gsl_matrix_float_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_float_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_float_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_float_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_float_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_float_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_float_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_float_view = _gsl_matrix_float_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_float_const_view {
    pub matrix: gsl_matrix_float,
}
#[test]
fn bindgen_test_layout__gsl_matrix_float_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_float_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_float_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_float_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_float_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_float_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_float_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_float_const_view = _gsl_matrix_float_const_view;
extern "C" {
    pub fn gsl_matrix_float_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_float;
}
extern "C" {
    pub fn gsl_matrix_float_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_float;
}
extern "C" {
    pub fn gsl_matrix_float_alloc_from_block(
        b: *mut gsl_block_float,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_float;
}
extern "C" {
    pub fn gsl_matrix_float_alloc_from_matrix(
        m: *mut gsl_matrix_float,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_float;
}
extern "C" {
    pub fn gsl_vector_float_alloc_row_from_matrix(
        m: *mut gsl_matrix_float,
        i: size_t,
    ) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_vector_float_alloc_col_from_matrix(
        m: *mut gsl_matrix_float,
        j: size_t,
    ) -> *mut gsl_vector_float;
}
extern "C" {
    pub fn gsl_matrix_float_free(m: *mut gsl_matrix_float);
}
extern "C" {
    pub fn gsl_matrix_float_submatrix(
        m: *mut gsl_matrix_float,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_row(m: *mut gsl_matrix_float, i: size_t) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_column(m: *mut gsl_matrix_float, j: size_t) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_diagonal(m: *mut gsl_matrix_float) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_subdiagonal(
        m: *mut gsl_matrix_float,
        k: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_superdiagonal(
        m: *mut gsl_matrix_float,
        k: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_subrow(
        m: *mut gsl_matrix_float,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_subcolumn(
        m: *mut gsl_matrix_float,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_view_array(
        base: *mut f32,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_view_array_with_tda(
        base: *mut f32,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_view_vector(
        v: *mut gsl_vector_float,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_view_vector_with_tda(
        v: *mut gsl_vector_float,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_float_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_submatrix(
        m: *const gsl_matrix_float,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_row(
        m: *const gsl_matrix_float,
        i: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_column(
        m: *const gsl_matrix_float,
        j: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_diagonal(
        m: *const gsl_matrix_float,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_subdiagonal(
        m: *const gsl_matrix_float,
        k: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_superdiagonal(
        m: *const gsl_matrix_float,
        k: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_subrow(
        m: *const gsl_matrix_float,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_subcolumn(
        m: *const gsl_matrix_float,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_view_array(
        base: *const f32,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_view_array_with_tda(
        base: *const f32,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_view_vector(
        v: *const gsl_vector_float,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_const_view_vector_with_tda(
        v: *const gsl_vector_float,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_float_const_view;
}
extern "C" {
    pub fn gsl_matrix_float_set_zero(m: *mut gsl_matrix_float);
}
extern "C" {
    pub fn gsl_matrix_float_set_identity(m: *mut gsl_matrix_float);
}
extern "C" {
    pub fn gsl_matrix_float_set_all(m: *mut gsl_matrix_float, x: f32);
}
extern "C" {
    pub fn gsl_matrix_float_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_float,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_memcpy(
        dest: *mut gsl_matrix_float,
        src: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_swap(
        m1: *mut gsl_matrix_float,
        m2: *mut gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_float,
        src: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_swap_rows(
        m: *mut gsl_matrix_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_swap_columns(
        m: *mut gsl_matrix_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_swap_rowcol(
        m: *mut gsl_matrix_float,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_transpose(m: *mut gsl_matrix_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_transpose_memcpy(
        dest: *mut gsl_matrix_float,
        src: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_float,
        src: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_max(m: *const gsl_matrix_float) -> f32;
}
extern "C" {
    pub fn gsl_matrix_float_min(m: *const gsl_matrix_float) -> f32;
}
extern "C" {
    pub fn gsl_matrix_float_minmax(
        m: *const gsl_matrix_float,
        min_out: *mut f32,
        max_out: *mut f32,
    );
}
extern "C" {
    pub fn gsl_matrix_float_max_index(
        m: *const gsl_matrix_float,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_float_min_index(
        m: *const gsl_matrix_float,
        imin: *mut size_t,
        jmin: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_float_minmax_index(
        m: *const gsl_matrix_float,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_float_equal(
        a: *const gsl_matrix_float,
        b: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_isnull(m: *const gsl_matrix_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_ispos(m: *const gsl_matrix_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_isneg(m: *const gsl_matrix_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_isnonneg(m: *const gsl_matrix_float) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_norm1(m: *const gsl_matrix_float) -> f32;
}
extern "C" {
    pub fn gsl_matrix_float_add(
        a: *mut gsl_matrix_float,
        b: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_sub(
        a: *mut gsl_matrix_float,
        b: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_mul_elements(
        a: *mut gsl_matrix_float,
        b: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_div_elements(
        a: *mut gsl_matrix_float,
        b: *const gsl_matrix_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_scale(a: *mut gsl_matrix_float, x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_scale_rows(
        a: *mut gsl_matrix_float,
        x: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_scale_columns(
        a: *mut gsl_matrix_float,
        x: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_add_constant(a: *mut gsl_matrix_float, x: f32)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_add_diagonal(a: *mut gsl_matrix_float, x: f32)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_get_row(
        v: *mut gsl_vector_float,
        m: *const gsl_matrix_float,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_get_col(
        v: *mut gsl_vector_float,
        m: *const gsl_matrix_float,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_set_row(
        m: *mut gsl_matrix_float,
        i: size_t,
        v: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_set_col(
        m: *mut gsl_matrix_float,
        j: size_t,
        v: *const gsl_vector_float,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_float_get(m: *const gsl_matrix_float, i: size_t, j: size_t) -> f32;
}
extern "C" {
    pub fn gsl_matrix_float_set(m: *mut gsl_matrix_float, i: size_t, j: size_t, x: f32);
}
extern "C" {
    pub fn gsl_matrix_float_ptr(m: *mut gsl_matrix_float, i: size_t, j: size_t) -> *mut f32;
}
extern "C" {
    pub fn gsl_matrix_float_const_ptr(
        m: *const gsl_matrix_float,
        i: size_t,
        j: size_t,
    ) -> *const f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_ulong {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut ::std::os::raw::c_ulong,
    pub block: *mut gsl_block_ulong,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_ulong() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_ulong>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_ulong))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_ulong>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_ulong))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_ulong>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_ulong),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_ulong_view {
    pub matrix: gsl_matrix_ulong,
}
#[test]
fn bindgen_test_layout__gsl_matrix_ulong_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_ulong_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_ulong_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_ulong_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_ulong_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_ulong_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_ulong_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_ulong_view = _gsl_matrix_ulong_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_ulong_const_view {
    pub matrix: gsl_matrix_ulong,
}
#[test]
fn bindgen_test_layout__gsl_matrix_ulong_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_ulong_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_ulong_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_ulong_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_ulong_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_ulong_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_ulong_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_ulong_const_view = _gsl_matrix_ulong_const_view;
extern "C" {
    pub fn gsl_matrix_ulong_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_alloc_from_block(
        b: *mut gsl_block_ulong,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_alloc_from_matrix(
        m: *mut gsl_matrix_ulong,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_alloc_row_from_matrix(
        m: *mut gsl_matrix_ulong,
        i: size_t,
    ) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_vector_ulong_alloc_col_from_matrix(
        m: *mut gsl_matrix_ulong,
        j: size_t,
    ) -> *mut gsl_vector_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_free(m: *mut gsl_matrix_ulong);
}
extern "C" {
    pub fn gsl_matrix_ulong_submatrix(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_row(m: *mut gsl_matrix_ulong, i: size_t) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_column(m: *mut gsl_matrix_ulong, j: size_t) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_diagonal(m: *mut gsl_matrix_ulong) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_subdiagonal(
        m: *mut gsl_matrix_ulong,
        k: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_superdiagonal(
        m: *mut gsl_matrix_ulong,
        k: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_subrow(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_subcolumn(
        m: *mut gsl_matrix_ulong,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_view_array(
        base: *mut ::std::os::raw::c_ulong,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_view_array_with_tda(
        base: *mut ::std::os::raw::c_ulong,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_view_vector(
        v: *mut gsl_vector_ulong,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_view_vector_with_tda(
        v: *mut gsl_vector_ulong,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_ulong_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_submatrix(
        m: *const gsl_matrix_ulong,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_row(
        m: *const gsl_matrix_ulong,
        i: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_column(
        m: *const gsl_matrix_ulong,
        j: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_diagonal(
        m: *const gsl_matrix_ulong,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_subdiagonal(
        m: *const gsl_matrix_ulong,
        k: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_superdiagonal(
        m: *const gsl_matrix_ulong,
        k: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_subrow(
        m: *const gsl_matrix_ulong,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_subcolumn(
        m: *const gsl_matrix_ulong,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_view_array(
        base: *const ::std::os::raw::c_ulong,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_view_array_with_tda(
        base: *const ::std::os::raw::c_ulong,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_view_vector(
        v: *const gsl_vector_ulong,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_view_vector_with_tda(
        v: *const gsl_vector_ulong,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_ulong_const_view;
}
extern "C" {
    pub fn gsl_matrix_ulong_set_zero(m: *mut gsl_matrix_ulong);
}
extern "C" {
    pub fn gsl_matrix_ulong_set_identity(m: *mut gsl_matrix_ulong);
}
extern "C" {
    pub fn gsl_matrix_ulong_set_all(m: *mut gsl_matrix_ulong, x: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn gsl_matrix_ulong_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_ulong,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_memcpy(
        dest: *mut gsl_matrix_ulong,
        src: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_swap(
        m1: *mut gsl_matrix_ulong,
        m2: *mut gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_ulong,
        src: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_swap_rows(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_swap_columns(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_swap_rowcol(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_transpose(m: *mut gsl_matrix_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_transpose_memcpy(
        dest: *mut gsl_matrix_ulong,
        src: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_ulong,
        src: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_max(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_min(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_minmax(
        m: *const gsl_matrix_ulong,
        min_out: *mut ::std::os::raw::c_ulong,
        max_out: *mut ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn gsl_matrix_ulong_max_index(
        m: *const gsl_matrix_ulong,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_ulong_min_index(
        m: *const gsl_matrix_ulong,
        imin: *mut size_t,
        jmin: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_ulong_minmax_index(
        m: *const gsl_matrix_ulong,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_ulong_equal(
        a: *const gsl_matrix_ulong,
        b: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_isnull(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_ispos(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_isneg(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_isnonneg(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_norm1(m: *const gsl_matrix_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_add(
        a: *mut gsl_matrix_ulong,
        b: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_sub(
        a: *mut gsl_matrix_ulong,
        b: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_mul_elements(
        a: *mut gsl_matrix_ulong,
        b: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_div_elements(
        a: *mut gsl_matrix_ulong,
        b: *const gsl_matrix_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_scale(
        a: *mut gsl_matrix_ulong,
        x: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_scale_rows(
        a: *mut gsl_matrix_ulong,
        x: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_scale_columns(
        a: *mut gsl_matrix_ulong,
        x: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_add_constant(
        a: *mut gsl_matrix_ulong,
        x: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_add_diagonal(
        a: *mut gsl_matrix_ulong,
        x: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_get_row(
        v: *mut gsl_vector_ulong,
        m: *const gsl_matrix_ulong,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_get_col(
        v: *mut gsl_vector_ulong,
        m: *const gsl_matrix_ulong,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_set_row(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        v: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_set_col(
        m: *mut gsl_matrix_ulong,
        j: size_t,
        v: *const gsl_vector_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_ulong_get(
        m: *const gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_set(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
        x: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn gsl_matrix_ulong_ptr(
        m: *mut gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn gsl_matrix_ulong_const_ptr(
        m: *const gsl_matrix_ulong,
        i: size_t,
        j: size_t,
    ) -> *const ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_long {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut ::std::os::raw::c_long,
    pub block: *mut gsl_block_long,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_long() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_long>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_long))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_long>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_long))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_long>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_long),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_long_view {
    pub matrix: gsl_matrix_long,
}
#[test]
fn bindgen_test_layout__gsl_matrix_long_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_long_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_long_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_long_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_long_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_long_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_long_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_long_view = _gsl_matrix_long_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_long_const_view {
    pub matrix: gsl_matrix_long,
}
#[test]
fn bindgen_test_layout__gsl_matrix_long_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_long_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_long_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_long_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_long_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_long_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_long_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_long_const_view = _gsl_matrix_long_const_view;
extern "C" {
    pub fn gsl_matrix_long_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_long;
}
extern "C" {
    pub fn gsl_matrix_long_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_long;
}
extern "C" {
    pub fn gsl_matrix_long_alloc_from_block(
        b: *mut gsl_block_long,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_long;
}
extern "C" {
    pub fn gsl_matrix_long_alloc_from_matrix(
        m: *mut gsl_matrix_long,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_long;
}
extern "C" {
    pub fn gsl_vector_long_alloc_row_from_matrix(
        m: *mut gsl_matrix_long,
        i: size_t,
    ) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_vector_long_alloc_col_from_matrix(
        m: *mut gsl_matrix_long,
        j: size_t,
    ) -> *mut gsl_vector_long;
}
extern "C" {
    pub fn gsl_matrix_long_free(m: *mut gsl_matrix_long);
}
extern "C" {
    pub fn gsl_matrix_long_submatrix(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_row(m: *mut gsl_matrix_long, i: size_t) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_column(m: *mut gsl_matrix_long, j: size_t) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_diagonal(m: *mut gsl_matrix_long) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_subdiagonal(m: *mut gsl_matrix_long, k: size_t)
        -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_superdiagonal(
        m: *mut gsl_matrix_long,
        k: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_subrow(
        m: *mut gsl_matrix_long,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_subcolumn(
        m: *mut gsl_matrix_long,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_view_array(
        base: *mut ::std::os::raw::c_long,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_view_array_with_tda(
        base: *mut ::std::os::raw::c_long,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_view_vector(
        v: *mut gsl_vector_long,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_view_vector_with_tda(
        v: *mut gsl_vector_long,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_long_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_submatrix(
        m: *const gsl_matrix_long,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_row(
        m: *const gsl_matrix_long,
        i: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_column(
        m: *const gsl_matrix_long,
        j: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_diagonal(m: *const gsl_matrix_long)
        -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_subdiagonal(
        m: *const gsl_matrix_long,
        k: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_superdiagonal(
        m: *const gsl_matrix_long,
        k: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_subrow(
        m: *const gsl_matrix_long,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_subcolumn(
        m: *const gsl_matrix_long,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_view_array(
        base: *const ::std::os::raw::c_long,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_view_array_with_tda(
        base: *const ::std::os::raw::c_long,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_view_vector(
        v: *const gsl_vector_long,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_const_view_vector_with_tda(
        v: *const gsl_vector_long,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_long_const_view;
}
extern "C" {
    pub fn gsl_matrix_long_set_zero(m: *mut gsl_matrix_long);
}
extern "C" {
    pub fn gsl_matrix_long_set_identity(m: *mut gsl_matrix_long);
}
extern "C" {
    pub fn gsl_matrix_long_set_all(m: *mut gsl_matrix_long, x: ::std::os::raw::c_long);
}
extern "C" {
    pub fn gsl_matrix_long_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_long,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_memcpy(
        dest: *mut gsl_matrix_long,
        src: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_swap(
        m1: *mut gsl_matrix_long,
        m2: *mut gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_long,
        src: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_swap_rows(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_swap_columns(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_swap_rowcol(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_transpose(m: *mut gsl_matrix_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_transpose_memcpy(
        dest: *mut gsl_matrix_long,
        src: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_long,
        src: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_max(m: *const gsl_matrix_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_matrix_long_min(m: *const gsl_matrix_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_matrix_long_minmax(
        m: *const gsl_matrix_long,
        min_out: *mut ::std::os::raw::c_long,
        max_out: *mut ::std::os::raw::c_long,
    );
}
extern "C" {
    pub fn gsl_matrix_long_max_index(
        m: *const gsl_matrix_long,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_long_min_index(
        m: *const gsl_matrix_long,
        imin: *mut size_t,
        jmin: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_long_minmax_index(
        m: *const gsl_matrix_long,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_long_equal(
        a: *const gsl_matrix_long,
        b: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_isnull(m: *const gsl_matrix_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_ispos(m: *const gsl_matrix_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_isneg(m: *const gsl_matrix_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_isnonneg(m: *const gsl_matrix_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_norm1(m: *const gsl_matrix_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_matrix_long_add(
        a: *mut gsl_matrix_long,
        b: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_sub(
        a: *mut gsl_matrix_long,
        b: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_mul_elements(
        a: *mut gsl_matrix_long,
        b: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_div_elements(
        a: *mut gsl_matrix_long,
        b: *const gsl_matrix_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_scale(
        a: *mut gsl_matrix_long,
        x: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_scale_rows(
        a: *mut gsl_matrix_long,
        x: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_scale_columns(
        a: *mut gsl_matrix_long,
        x: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_add_constant(
        a: *mut gsl_matrix_long,
        x: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_add_diagonal(
        a: *mut gsl_matrix_long,
        x: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_get_row(
        v: *mut gsl_vector_long,
        m: *const gsl_matrix_long,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_get_col(
        v: *mut gsl_vector_long,
        m: *const gsl_matrix_long,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_set_row(
        m: *mut gsl_matrix_long,
        i: size_t,
        v: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_set_col(
        m: *mut gsl_matrix_long,
        j: size_t,
        v: *const gsl_vector_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_long_get(
        m: *const gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_matrix_long_set(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
        x: ::std::os::raw::c_long,
    );
}
extern "C" {
    pub fn gsl_matrix_long_ptr(
        m: *mut gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    pub fn gsl_matrix_long_const_ptr(
        m: *const gsl_matrix_long,
        i: size_t,
        j: size_t,
    ) -> *const ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_uint {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut ::std::os::raw::c_uint,
    pub block: *mut gsl_block_uint,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_uint() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_uint>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_uint>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_uint),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_uint_view {
    pub matrix: gsl_matrix_uint,
}
#[test]
fn bindgen_test_layout__gsl_matrix_uint_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_uint_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_uint_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_uint_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_uint_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_uint_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_uint_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_uint_view = _gsl_matrix_uint_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_uint_const_view {
    pub matrix: gsl_matrix_uint,
}
#[test]
fn bindgen_test_layout__gsl_matrix_uint_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_uint_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_uint_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_uint_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_uint_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_uint_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_uint_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_uint_const_view = _gsl_matrix_uint_const_view;
extern "C" {
    pub fn gsl_matrix_uint_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_alloc_from_block(
        b: *mut gsl_block_uint,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_alloc_from_matrix(
        m: *mut gsl_matrix_uint,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_uint;
}
extern "C" {
    pub fn gsl_vector_uint_alloc_row_from_matrix(
        m: *mut gsl_matrix_uint,
        i: size_t,
    ) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_vector_uint_alloc_col_from_matrix(
        m: *mut gsl_matrix_uint,
        j: size_t,
    ) -> *mut gsl_vector_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_free(m: *mut gsl_matrix_uint);
}
extern "C" {
    pub fn gsl_matrix_uint_submatrix(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_row(m: *mut gsl_matrix_uint, i: size_t) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_column(m: *mut gsl_matrix_uint, j: size_t) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_diagonal(m: *mut gsl_matrix_uint) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_subdiagonal(m: *mut gsl_matrix_uint, k: size_t)
        -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_superdiagonal(
        m: *mut gsl_matrix_uint,
        k: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_subrow(
        m: *mut gsl_matrix_uint,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_subcolumn(
        m: *mut gsl_matrix_uint,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_view_array(
        base: *mut ::std::os::raw::c_uint,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_view_array_with_tda(
        base: *mut ::std::os::raw::c_uint,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_view_vector(
        v: *mut gsl_vector_uint,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_view_vector_with_tda(
        v: *mut gsl_vector_uint,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_uint_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_submatrix(
        m: *const gsl_matrix_uint,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_row(
        m: *const gsl_matrix_uint,
        i: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_column(
        m: *const gsl_matrix_uint,
        j: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_diagonal(m: *const gsl_matrix_uint)
        -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_subdiagonal(
        m: *const gsl_matrix_uint,
        k: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_superdiagonal(
        m: *const gsl_matrix_uint,
        k: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_subrow(
        m: *const gsl_matrix_uint,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_subcolumn(
        m: *const gsl_matrix_uint,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_view_array(
        base: *const ::std::os::raw::c_uint,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_view_array_with_tda(
        base: *const ::std::os::raw::c_uint,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_view_vector(
        v: *const gsl_vector_uint,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_const_view_vector_with_tda(
        v: *const gsl_vector_uint,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_uint_const_view;
}
extern "C" {
    pub fn gsl_matrix_uint_set_zero(m: *mut gsl_matrix_uint);
}
extern "C" {
    pub fn gsl_matrix_uint_set_identity(m: *mut gsl_matrix_uint);
}
extern "C" {
    pub fn gsl_matrix_uint_set_all(m: *mut gsl_matrix_uint, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn gsl_matrix_uint_fread(
        stream: *mut FILE,
        m: *mut gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_uint,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_memcpy(
        dest: *mut gsl_matrix_uint,
        src: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_swap(
        m1: *mut gsl_matrix_uint,
        m2: *mut gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_uint,
        src: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_swap_rows(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_swap_columns(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_swap_rowcol(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_transpose(m: *mut gsl_matrix_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_transpose_memcpy(
        dest: *mut gsl_matrix_uint,
        src: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_uint,
        src: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_max(m: *const gsl_matrix_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_min(m: *const gsl_matrix_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_minmax(
        m: *const gsl_matrix_uint,
        min_out: *mut ::std::os::raw::c_uint,
        max_out: *mut ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn gsl_matrix_uint_max_index(
        m: *const gsl_matrix_uint,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_uint_min_index(
        m: *const gsl_matrix_uint,
        imin: *mut size_t,
        jmin: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_uint_minmax_index(
        m: *const gsl_matrix_uint,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_uint_equal(
        a: *const gsl_matrix_uint,
        b: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_isnull(m: *const gsl_matrix_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_ispos(m: *const gsl_matrix_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_isneg(m: *const gsl_matrix_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_isnonneg(m: *const gsl_matrix_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_norm1(m: *const gsl_matrix_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_add(
        a: *mut gsl_matrix_uint,
        b: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_sub(
        a: *mut gsl_matrix_uint,
        b: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_mul_elements(
        a: *mut gsl_matrix_uint,
        b: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_div_elements(
        a: *mut gsl_matrix_uint,
        b: *const gsl_matrix_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_scale(
        a: *mut gsl_matrix_uint,
        x: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_scale_rows(
        a: *mut gsl_matrix_uint,
        x: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_scale_columns(
        a: *mut gsl_matrix_uint,
        x: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_add_constant(
        a: *mut gsl_matrix_uint,
        x: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_add_diagonal(
        a: *mut gsl_matrix_uint,
        x: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_get_row(
        v: *mut gsl_vector_uint,
        m: *const gsl_matrix_uint,
        i: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_get_col(
        v: *mut gsl_vector_uint,
        m: *const gsl_matrix_uint,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_set_row(
        m: *mut gsl_matrix_uint,
        i: size_t,
        v: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_set_col(
        m: *mut gsl_matrix_uint,
        j: size_t,
        v: *const gsl_vector_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_uint_get(
        m: *const gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_set(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
        x: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn gsl_matrix_uint_ptr(
        m: *mut gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> *mut ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gsl_matrix_uint_const_ptr(
        m: *const gsl_matrix_uint,
        i: size_t,
        j: size_t,
    ) -> *const ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gsl_matrix_int {
    pub size1: size_t,
    pub size2: size_t,
    pub tda: size_t,
    pub data: *mut ::std::os::raw::c_int,
    pub block: *mut gsl_block_int,
    pub owner: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_gsl_matrix_int() {
    assert_eq!(
        ::std::mem::size_of::<gsl_matrix_int>(),
        48usize,
        concat!("Size of: ", stringify!(gsl_matrix_int))
    );
    assert_eq!(
        ::std::mem::align_of::<gsl_matrix_int>(),
        8usize,
        concat!("Alignment of ", stringify!(gsl_matrix_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).size1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(size1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).size2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(size2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).tda as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(tda)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gsl_matrix_int>())).owner as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(gsl_matrix_int),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_int_view {
    pub matrix: gsl_matrix_int,
}
#[test]
fn bindgen_test_layout__gsl_matrix_int_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_int_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_int_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_int_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_int_view))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gsl_matrix_int_view>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_int_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_int_view = _gsl_matrix_int_view;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gsl_matrix_int_const_view {
    pub matrix: gsl_matrix_int,
}
#[test]
fn bindgen_test_layout__gsl_matrix_int_const_view() {
    assert_eq!(
        ::std::mem::size_of::<_gsl_matrix_int_const_view>(),
        48usize,
        concat!("Size of: ", stringify!(_gsl_matrix_int_const_view))
    );
    assert_eq!(
        ::std::mem::align_of::<_gsl_matrix_int_const_view>(),
        8usize,
        concat!("Alignment of ", stringify!(_gsl_matrix_int_const_view))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gsl_matrix_int_const_view>())).matrix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gsl_matrix_int_const_view),
            "::",
            stringify!(matrix)
        )
    );
}
pub type gsl_matrix_int_const_view = _gsl_matrix_int_const_view;
extern "C" {
    pub fn gsl_matrix_int_alloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_int;
}
extern "C" {
    pub fn gsl_matrix_int_calloc(n1: size_t, n2: size_t) -> *mut gsl_matrix_int;
}
extern "C" {
    pub fn gsl_matrix_int_alloc_from_block(
        b: *mut gsl_block_int,
        offset: size_t,
        n1: size_t,
        n2: size_t,
        d2: size_t,
    ) -> *mut gsl_matrix_int;
}
extern "C" {
    pub fn gsl_matrix_int_alloc_from_matrix(
        m: *mut gsl_matrix_int,
        k1: size_t,
        k2: size_t,
        n1: size_t,
        n2: size_t,
    ) -> *mut gsl_matrix_int;
}
extern "C" {
    pub fn gsl_vector_int_alloc_row_from_matrix(
        m: *mut gsl_matrix_int,
        i: size_t,
    ) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_vector_int_alloc_col_from_matrix(
        m: *mut gsl_matrix_int,
        j: size_t,
    ) -> *mut gsl_vector_int;
}
extern "C" {
    pub fn gsl_matrix_int_free(m: *mut gsl_matrix_int);
}
extern "C" {
    pub fn gsl_matrix_int_submatrix(
        m: *mut gsl_matrix_int,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_row(m: *mut gsl_matrix_int, i: size_t) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_column(m: *mut gsl_matrix_int, j: size_t) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_diagonal(m: *mut gsl_matrix_int) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_subdiagonal(m: *mut gsl_matrix_int, k: size_t) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_superdiagonal(m: *mut gsl_matrix_int, k: size_t) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_subrow(
        m: *mut gsl_matrix_int,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_subcolumn(
        m: *mut gsl_matrix_int,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_view_array(
        base: *mut ::std::os::raw::c_int,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_view_array_with_tda(
        base: *mut ::std::os::raw::c_int,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_view_vector(
        v: *mut gsl_vector_int,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_view_vector_with_tda(
        v: *mut gsl_vector_int,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_int_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_submatrix(
        m: *const gsl_matrix_int,
        i: size_t,
        j: size_t,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_row(
        m: *const gsl_matrix_int,
        i: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_column(
        m: *const gsl_matrix_int,
        j: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_diagonal(m: *const gsl_matrix_int) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_subdiagonal(
        m: *const gsl_matrix_int,
        k: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_superdiagonal(
        m: *const gsl_matrix_int,
        k: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_subrow(
        m: *const gsl_matrix_int,
        i: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_subcolumn(
        m: *const gsl_matrix_int,
        j: size_t,
        offset: size_t,
        n: size_t,
    ) -> _gsl_vector_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_view_array(
        base: *const ::std::os::raw::c_int,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_view_array_with_tda(
        base: *const ::std::os::raw::c_int,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_view_vector(
        v: *const gsl_vector_int,
        n1: size_t,
        n2: size_t,
    ) -> _gsl_matrix_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_const_view_vector_with_tda(
        v: *const gsl_vector_int,
        n1: size_t,
        n2: size_t,
        tda: size_t,
    ) -> _gsl_matrix_int_const_view;
}
extern "C" {
    pub fn gsl_matrix_int_set_zero(m: *mut gsl_matrix_int);
}
extern "C" {
    pub fn gsl_matrix_int_set_identity(m: *mut gsl_matrix_int);
}
extern "C" {
    pub fn gsl_matrix_int_set_all(m: *mut gsl_matrix_int, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn gsl_matrix_int_fread(stream: *mut FILE, m: *mut gsl_matrix_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_fwrite(
        stream: *mut FILE,
        m: *const gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_fscanf(
        stream: *mut FILE,
        m: *mut gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_fprintf(
        stream: *mut FILE,
        m: *const gsl_matrix_int,
        format: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_memcpy(
        dest: *mut gsl_matrix_int,
        src: *const gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_swap(
        m1: *mut gsl_matrix_int,
        m2: *mut gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_tricpy(
        Uplo: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_int,
        src: *const gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_swap_rows(
        m: *mut gsl_matrix_int,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_swap_columns(
        m: *mut gsl_matrix_int,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_swap_rowcol(
        m: *mut gsl_matrix_int,
        i: size_t,
        j: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_transpose(m: *mut gsl_matrix_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_transpose_memcpy(
        dest: *mut gsl_matrix_int,
        src: *const gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_transpose_tricpy(
        Uplo_src: CBLAS_UPLO_t,
        Diag: CBLAS_DIAG_t,
        dest: *mut gsl_matrix_int,
        src: *const gsl_matrix_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_max(m: *const gsl_matrix_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_min(m: *const gsl_matrix_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gsl_matrix_int_minmax(
        m: *const gsl_matrix_int,
        min_out: *mut ::std::os::raw::c_int,
        max_out: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn gsl_matrix_int_max_index(m: *const gsl_matrix_int, imax: *mut size_t, jmax: *mut size_t);
}
extern "C" {
    pub fn gsl_matrix_int_min_index(m: *const gsl_matrix_int, imin: *mut size_t, jmin: *mut size_t);
}
extern "C" {
    pub fn gsl_matrix_int_minmax_index(
        m: *const gsl_matrix_int,
        imin: *mut size_t,
        jmin: *mut size_t,
        imax: *mut size_t,
        jmax: *mut size_t,
    );
}
extern "C" {
    pub fn gsl_matrix_int_equal(
        a: *const gsl_matrix_int,
